FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define I2C0STAT (*(volatile unsigned char *)0x4001C004)
#define I2C0STAT_OFFSET 0x4
#define I2C0STAT_Status_MASK 0xF8
#define I2C0STAT_Status_BIT 3

#define I2C0DAT (*(volatile unsigned char *)0x4001C008)
#define I2C0DAT_OFFSET 0x8

#define I2C0ADR0 (*(volatile unsigned char *)0x4001C00C)
#define I2C0ADR0_OFFSET 0xC
#define I2C0ADR0_GC_MASK 0x1
#define I2C0ADR0_GC 0x1
#define I2C0ADR0_GC_BIT 0
#define I2C0ADR0_Address_MASK 0xFE
#define I2C0ADR0_Address_BIT 1

#define I2C0SCLH (*(volatile unsigned short *)0x4001C010)
#define I2C0SCLH_OFFSET 0x10

#define I2C0SCLL (*(volatile unsigned short *)0x4001C014)
#define I2C0SCLL_OFFSET 0x14

#define I2C0CONCLR (*(volatile unsigned char *)0x4001C018)
#define I2C0CONCLR_OFFSET 0x18
#define I2C0CONCLR_AAC_MASK 0x4
#define I2C0CONCLR_AAC 0x4
#define I2C0CONCLR_AAC_BIT 2
#define I2C0CONCLR_SIC_MASK 0x8
#define I2C0CONCLR_SIC 0x8
#define I2C0CONCLR_SIC_BIT 3
#define I2C0CONCLR_STAC_MASK 0x20
#define I2C0CONCLR_STAC 0x20
#define I2C0CONCLR_STAC_BIT 5
#define I2C0CONCLR_I2ENC_MASK 0x40
#define I2C0CONCLR_I2ENC 0x40
#define I2C0CONCLR_I2ENC_BIT 6

#define I2C0MMCTRL (*(volatile unsigned char *)0x4001C01C)
#define I2C0MMCTRL_OFFSET 0x1C
#define I2C0MMCTRL_MM_ENA_MASK 0x1
#define I2C0MMCTRL_MM_ENA 0x1
#define I2C0MMCTRL_MM_ENA_BIT 0
#define I2C0MMCTRL_ENA_SCL_MASK 0x2
#define I2C0MMCTRL_ENA_SCL 0x2
#define I2C0MMCTRL_ENA_SCL_BIT 1
#define I2C0MMCTRL_MATCH_ALL_MASK 0x8
#define I2C0MMCTRL_MATCH_ALL 0x8
#define I2C0MMCTRL_MATCH_ALL_BIT 3

#define I2C0ADR1 (*(volatile unsigned char *)0x4001C020)
#define I2C0ADR1_OFFSET 0x20
#define I2C0ADR1_GC_MASK 0x1
#define I2C0ADR1_GC 0x1
#define I2C0ADR1_GC_BIT 0
#define I2C0ADR1_Address_MASK 0xFE
#define I2C0ADR1_Address_BIT 1

#define I2C0ADR2 (*(volatile unsigned char *)0x4001C024)
#define I2C0ADR2_OFFSET 0x24
#define I2C0ADR2_GC_MASK 0x1
#define I2C0ADR2_GC 0x1
#define I2C0ADR2_GC_BIT 0
#define I2C0ADR2_Address_MASK 0xFE
#define I2C0ADR2_Address_BIT 1

#define I2C0ADR3 (*(volatile unsigned char *)0x4001C028)
#define I2C0ADR3_OFFSET 0x28
#define I2C0ADR3_GC_MASK 0x1
#define I2C0ADR3_GC 0x1
#define I2C0ADR3_GC_BIT 0
#define I2C0ADR3_Address_MASK 0xFE
#define I2C0ADR3_Address_BIT 1

#define I2C0DATA_BUFFER (*(volatile unsigned char *)0x4001C02C)
#define I2C0DATA_BUFFER_OFFSET 0x2C

#define I2C0MASK0 (*(volatile unsigned long *)0x4001C030)
#define I2C0MASK0_OFFSET 0x30
#define I2C0MASK0_MASK_MASK 0xFE
#define I2C0MASK0_MASK_BIT 1

#define I2C0MASK1 (*(volatile unsigned long *)0x4001C034)
#define I2C0MASK1_OFFSET 0x34
#define I2C0MASK1_MASK_MASK 0xFE
#define I2C0MASK1_MASK_BIT 1

#define I2C0MASK2 (*(volatile unsigned long *)0x4001C038)
#define I2C0MASK2_OFFSET 0x38
#define I2C0MASK2_MASK_MASK 0xFE
#define I2C0MASK2_MASK_BIT 1

#define I2C0MASK3 (*(volatile unsigned long *)0x4001C03C)
#define I2C0MASK3_OFFSET 0x3C
#define I2C0MASK3_MASK_MASK 0xFE
#define I2C0MASK3_MASK_BIT 1

#define SPI0_BASE_ADDRESS 0x40020000

#define S0SPCR (*(volatile unsigned short *)0x40020000)
#define S0SPCR_OFFSET 0x0
#define S0SPCR_BitEnable_MASK 0x4
#define S0SPCR_BitEnable 0x4
#define S0SPCR_BitEnable_BIT 2
#define S0SPCR_CPHA_MASK 0x8
#define S0SPCR_CPHA 0x8
#define S0SPCR_CPHA_BIT 3
#define S0SPCR_CPOL_MASK 0x10
#define S0SPCR_CPOL 0x10
#define S0SPCR_CPOL_BIT 4
#define S0SPCR_MSTR_MASK 0x20
#define S0SPCR_MSTR 0x20
#define S0SPCR_MSTR_BIT 5
#define S0SPCR_LSBF_MASK 0x40
#define S0SPCR_LSBF 0x40
#define S0SPCR_LSBF_BIT 6
#define S0SPCR_SPIE_MASK 0x80
#define S0SPCR_SPIE 0x80
#define S0SPCR_SPIE_BIT 7
#define S0SPCR_BITS_MASK 0xF00
#define S0SPCR_BITS_BIT 8

#define S0SPSR (*(volatile unsigned char *)0x40020004)
#define S0SPSR_OFFSET 0x4
#define S0SPSR_ABRT_MASK 0x8
#define S0SPSR_ABRT 0x8
#define S0SPSR_ABRT_BIT 3
#define S0SPSR_MODF_MASK 0x10
#define S0SPSR_MODF 0x10
#define S0SPSR_MODF_BIT 4
#define S0SPSR_ROVR_MASK 0x20
#define S0SPSR_ROVR 0x20
#define S0SPSR_ROVR_BIT 5
#define S0SPSR_WCOL_MASK 0x40
#define S0SPSR_WCOL 0x40
#define S0SPSR_WCOL_BIT 6
#define S0SPSR_SPIF_MASK 0x80
#define S0SPSR_SPIF 0x80
#define S0SPSR_SPIF_BIT 7

#define S0SPDR (*(volatile unsigned short *)0x40020008)
#define S0SPDR_OFFSET 0x8

#define S0SPCCR (*(volatile unsigned char *)0x4002000C)
#define S0SPCCR_OFFSET 0xC

#define S0SPINT (*(volatile unsigned char *)0x4002001C)
#define S0SPINT_OFFSET 0x1C

#define RTC_BASE_ADDRESS 0x40024000

#define ILR (*(volatile unsigned char *)0x40024000)
#define ILR_OFFSET 0x0
#define ILR_RTCCIF_MASK 0x1
#define ILR_RTCCIF 0x1
#define ILR_RTCCIF_BIT 0
#define ILR_RTCALF_MASK 0x2
#define ILR_RTCALF 0x2
#define ILR_RTCALF_BIT 1

#define CCR (*(volatile unsigned char *)0x40024008)
#define CCR_OFFSET 0x8
#define CCR_CLKEN_MASK 0x1
#define CCR_CLKEN 0x1
#define CCR_CLKEN_BIT 0
#define CCR_CTCRST_MASK 0x2
#define CCR_CTCRST 0x2
#define CCR_CTCRST_BIT 1
#define CCR_CCALEN_MASK 0x10
#define CCR_CCALEN 0x10
#define CCR_CCALEN_BIT 4

#define CIIR (*(volatile unsigned char *)0x4002400C)
#define CIIR_OFFSET 0xC
#define CIIR_IMSEC_MASK 0x1
#define CIIR_IMSEC 0x1
#define CIIR_IMSEC_BIT 0
#define CIIR_IMMIN_MASK 0x2
#define CIIR_IMMIN 0x2
#define CIIR_IMMIN_BIT 1
#define CIIR_IMHOUR_MASK 0x4
#define CIIR_IMHOUR 0x4
#define CIIR_IMHOUR_BIT 2
#define CIIR_IMDOM_MASK 0x8
#define CIIR_IMDOM 0x8
#define CIIR_IMDOM_BIT 3
#define CIIR_IMDOW_MASK 0x10
#define CIIR_IMDOW 0x10
#define CIIR_IMDOW_BIT 4
#define CIIR_IMDOY_MASK 0x20
#define CIIR_IMDOY 0x20
#define CIIR_IMDOY_BIT 5
#define CIIR_IMMON_MASK 0x40
#define CIIR_IMMON 0x40
#define CIIR_IMMON_BIT 6
#define CIIR_IMYEAR_MASK 0x80
#define CIIR_IMYEAR 0x80
#define CIIR_IMYEAR_BIT 7

#define AMR (*(volatile unsigned char *)0x40024010)
#define AMR_OFFSET 0x10
#define AMR_AMRSEC_MASK 0x1
#define AMR_AMRSEC 0x1
#define AMR_AMRSEC_BIT 0
#define AMR_AMRMIN_MASK 0x2
#define AMR_AMRMIN 0x2
#define AMR_AMRMIN_BIT 1
#define AMR_AMRHOUR_MASK 0x4
#define AMR_AMRHOUR 0x4
#define AMR_AMRHOUR_BIT 2
#define AMR_AMRDOM_MASK 0x8
#define AMR_AMRDOM 0x8
#define AMR_AMRDOM_BIT 3
#define AMR_AMRDOW_MASK 0x10
#define AMR_AMRDOW 0x10
#define AMR_AMRDOW_BIT 4
#define AMR_AMRDOY_MASK 0x20
#define AMR_AMRDOY 0x20
#define AMR_AMRDOY_BIT 5
#define AMR_AMRMON_MASK 0x40
#define AMR_AMRMON 0x40
#define AMR_AMRMON_BIT 6
#define AMR_AMRYEAR_MASK 0x80
#define AMR_AMRYEAR 0x80
#define AMR_AMRYEAR_BIT 7

#define CTIME0 (*(volatile unsigned long *)0x40024014)
#define CTIME0_OFFSET 0x14
#define CTIME0_Seconds_MASK 0x3F
#define CTIME0_Seconds_BIT 0
#define CTIME0_Minutes_MASK 0x3F00
#define CTIME0_Minutes_BIT 8
#define CTIME0_Hours_MASK 0x1F0000
#define CTIME0_Hours_BIT 16
#define CTIME0_Day_of_Week_MASK 0x7000000
#define CTIME0_Day_of_Week_BIT 24

#define CTIME1 (*(volatile unsigned long *)0x40024018)
#define CTIME1_OFFSET 0x18
#define CTIME1_Day_of_Month_MASK 0x1F
#define CTIME1_Day_of_Month_BIT 0
#define CTIME1_Month_MASK 0xF00
#define CTIME1_Month_BIT 8
#define CTIME1_Year_MASK 0xFFF0000
#define CTIME1_Year_BIT 16

