FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define U2SCR (*(volatile unsigned char *)0x4009801C)
#define U2SCR_OFFSET 0x1C

#define U2ACR (*(volatile unsigned long *)0x40098020)
#define U2ACR_OFFSET 0x20
#define U2ACR_Start_MASK 0x1
#define U2ACR_Start 0x1
#define U2ACR_Start_BIT 0
#define U2ACR_Mode_MASK 0x2
#define U2ACR_Mode 0x2
#define U2ACR_Mode_BIT 1
#define U2ACR_AutoRestart_MASK 0x4
#define U2ACR_AutoRestart 0x4
#define U2ACR_AutoRestart_BIT 2
#define U2ACR_ABEOIntClr_MASK 0x100
#define U2ACR_ABEOIntClr 0x100
#define U2ACR_ABEOIntClr_BIT 8
#define U2ACR_ABTOIntClr_MASK 0x200
#define U2ACR_ABTOIntClr 0x200
#define U2ACR_ABTOIntClr_BIT 9

#define U2FDR (*(volatile unsigned long *)0x40098028)
#define U2FDR_OFFSET 0x28
#define U2FDR_DIVADDVAL_MASK 0xF
#define U2FDR_DIVADDVAL_BIT 0
#define U2FDR_MULVAL_MASK 0xF0
#define U2FDR_MULVAL_BIT 4

#define U2TER (*(volatile unsigned char *)0x40098030)
#define U2TER_OFFSET 0x30
#define U2TER_TXEN_MASK 0x80
#define U2TER_TXEN 0x80
#define U2TER_TXEN_BIT 7

#define U2FIFOLVL (*(volatile unsigned char *)0x40098058)
#define U2FIFOLVL_OFFSET 0x58
#define U2FIFOLVL_RXFIFILVL_MASK 0xF
#define U2FIFOLVL_RXFIFILVL_BIT 0
#define U2FIFOLVL_RXFIFOLVL_MASK 0xF00
#define U2FIFOLVL_RXFIFOLVL_BIT 8

#define UART3_BASE_ADDRESS 0x4009C000

#define U3RBR (*(volatile unsigned char *)0x4009C000)
#define U3RBR_OFFSET 0x0

#define U3THR (*(volatile unsigned char *)0x4009C000)
#define U3THR_OFFSET 0x0

#define U3DLL (*(volatile unsigned char *)0x4009C000)
#define U3DLL_OFFSET 0x0

#define U3DLM (*(volatile unsigned char *)0x4009C004)
#define U3DLM_OFFSET 0x4

#define U3IER (*(volatile unsigned long *)0x4009C004)
#define U3IER_OFFSET 0x4
#define U3IER_RBR_Interrupt_Enable_MASK 0x1
#define U3IER_RBR_Interrupt_Enable 0x1
#define U3IER_RBR_Interrupt_Enable_BIT 0
#define U3IER_THRE_Interrupt_Enable_MASK 0x2
#define U3IER_THRE_Interrupt_Enable 0x2
#define U3IER_THRE_Interrupt_Enable_BIT 1
#define U3IER_Rx_Line_Status_Interrupt_Enable_MASK 0x4
#define U3IER_Rx_Line_Status_Interrupt_Enable 0x4
#define U3IER_Rx_Line_Status_Interrupt_Enable_BIT 2
#define U3IER_ABTOIntEn_MASK 0x100
#define U3IER_ABTOIntEn 0x100
#define U3IER_ABTOIntEn_BIT 8
#define U3IER_ABEOIntEn_MASK 0x200
#define U3IER_ABEOIntEn 0x200
#define U3IER_ABEOIntEn_BIT 9

#define U3IIR (*(volatile unsigned long *)0x4009C008)
#define U3IIR_OFFSET 0x8
#define U3IIR_IntStatus_MASK 0x1
#define U3IIR_IntStatus 0x1
#define U3IIR_IntStatus_BIT 0
#define U3IIR_IntId_MASK 0xE
#define U3IIR_IntId_BIT 1
#define U3IIR_FIFO_Enable_MASK 0xC0
#define U3IIR_FIFO_Enable_BIT 6
#define U3IIR_ABEOInt_MASK 0x100
#define U3IIR_ABEOInt 0x100
#define U3IIR_ABEOInt_BIT 8
#define U3IIR_ABTOInt_MASK 0x200
#define U3IIR_ABTOInt 0x200
#define U3IIR_ABTOInt_BIT 9

#define U3FCR (*(volatile unsigned char *)0x4009C008)
#define U3FCR_OFFSET 0x8
#define U3FCR_FIFO_Enable_MASK 0x1
#define U3FCR_FIFO_Enable 0x1
#define U3FCR_FIFO_Enable_BIT 0
#define U3FCR_Rx_FIFO_Reset_MASK 0x2
#define U3FCR_Rx_FIFO_Reset 0x2
#define U3FCR_Rx_FIFO_Reset_BIT 1
#define U3FCR_Tx_FIFO_Reset_MASK 0x4
#define U3FCR_Tx_FIFO_Reset 0x4
#define U3FCR_Tx_FIFO_Reset_BIT 2
#define U3FCR_DMA_Mode_Select_MASK 0x8
#define U3FCR_DMA_Mode_Select 0x8
#define U3FCR_DMA_Mode_Select_BIT 3
#define U3FCR_Rx_Trigger_Level_Select_MASK 0xC0
#define U3FCR_Rx_Trigger_Level_Select_BIT 6

#define U3LCR (*(volatile unsigned char *)0x4009C00C)
#define U3LCR_OFFSET 0xC
#define U3LCR_Word_Length_Select_MASK 0x3
#define U3LCR_Word_Length_Select_BIT 0
#define U3LCR_Stop_Bit_Select_MASK 0x4
#define U3LCR_Stop_Bit_Select 0x4
#define U3LCR_Stop_Bit_Select_BIT 2
#define U3LCR_Parity_Enable_MASK 0x8
#define U3LCR_Parity_Enable 0x8
#define U3LCR_Parity_Enable_BIT 3
#define U3LCR_Parity_Select_MASK 0x30
#define U3LCR_Parity_Select_BIT 4
#define U3LCR_Break_Control_MASK 0x40
#define U3LCR_Break_Control 0x40
#define U3LCR_Break_Control_BIT 6
#define U3LCR_Divisor_Latch_Access_Bit_MASK 0x80
#define U3LCR_Divisor_Latch_Access_Bit 0x80
#define U3LCR_Divisor_Latch_Access_Bit_BIT 7

#define U3LSR (*(volatile unsigned char *)0x4009C014)
#define U3LSR_OFFSET 0x14
#define U3LSR_RDR_MASK 0x1
#define U3LSR_RDR 0x1
#define U3LSR_RDR_BIT 0
#define U3LSR_OE_MASK 0x2
#define U3LSR_OE 0x2
#define U3LSR_OE_BIT 1
#define U3LSR_PE_MASK 0x4
#define U3LSR_PE 0x4
#define U3LSR_PE_BIT 2
#define U3LSR_FE_MASK 0x8
#define U3LSR_FE 0x8
#define U3LSR_FE_BIT 3
#define U3LSR_BI_MASK 0x10
#define U3LSR_BI 0x10
#define U3LSR_BI_BIT 4
#define U3LSR_THRE_MASK 0x20
#define U3LSR_THRE 0x20
#define U3LSR_THRE_BIT 5
#define U3LSR_TEMT_MASK 0x40
#define U3LSR_TEMT 0x40
#define U3LSR_TEMT_BIT 6
#define U3LSR_RXFE_MASK 0x80
#define U3LSR_RXFE 0x80
#define U3LSR_RXFE_BIT 7

#define U3SCR (*(volatile unsigned char *)0x4009C01C)
#define U3SCR_OFFSET 0x1C

#define U3ACR (*(volatile unsigned long *)0x4009C020)
#define U3ACR_OFFSET 0x20
#define U3ACR_Start_MASK 0x1
#define U3ACR_Start 0x1
#define U3ACR_Start_BIT 0
#define U3ACR_Mode_MASK 0x2
#define U3ACR_Mode 0x2
#define U3ACR_Mode_BIT 1
#define U3ACR_AutoRestart_MASK 0x4
#define U3ACR_AutoRestart 0x4
#define U3ACR_AutoRestart_BIT 2
#define U3ACR_ABEOIntClr_MASK 0x100
#define U3ACR_ABEOIntClr 0x100
#define U3ACR_ABEOIntClr_BIT 8
#define U3ACR_ABTOIntClr_MASK 0x200
#define U3ACR_ABTOIntClr 0x200
#define U3ACR_ABTOIntClr_BIT 9

#define U3ICR (*(volatile unsigned long *)0x4009C024)
#define U3ICR_OFFSET 0x24
#define U3ICR_IrDAEn_MASK 0x1
#define U3ICR_IrDAEn 0x1
#define U3ICR_IrDAEn_BIT 0
#define U3ICR_IrDAInv_MASK 0x2
#define U3ICR_IrDAInv 0x2
#define U3ICR_IrDAInv_BIT 1
#define U3ICR_FixPulse_En_MASK 0x4
#define U3ICR_FixPulse_En 0x4
#define U3ICR_FixPulse_En_BIT 2
#define U3ICR_PulseDiv_MASK 0x38
#define U3ICR_PulseDiv_BIT 3

#define U3FDR (*(volatile unsigned long *)0x4009C028)
#define U3FDR_OFFSET 0x28
#define U3FDR_DIVADDVAL_MASK 0xF
#define U3FDR_DIVADDVAL_BIT 0
#define U3FDR_MULVAL_MASK 0xF0
#define U3FDR_MULVAL_BIT 4

#define U3TER (*(volatile unsigned char *)0x4009C030)
#define U3TER_OFFSET 0x30
#define U3TER_TXEN_MASK 0x80
#define U3TER_TXEN 0x80
#define U3TER_TXEN_BIT 7

#define U3FIFOLVL (*(volatile unsigned char *)0x4009C058)
#define U3FIFOLVL_OFFSET 0x58
#define U3FIFOLVL_RXFIFILVL_MASK 0xF
#define U3FIFOLVL_RXFIFILVL_BIT 0
#define U3FIFOLVL_RXFIFOLVL_MASK 0xF00
#define U3FIFOLVL_RXFIFOLVL_BIT 8

#define I2C2_BASE_ADDRESS 0x400A0000

#define I2C2CONSET (*(volatile unsigned char *)0x400A0000)
#define I2C2CONSET_OFFSET 0x0
#define I2C2CONSET_AA_MASK 0x4
#define I2C2CONSET_AA 0x4
#define I2C2CONSET_AA_BIT 2
#define I2C2CONSET_SI_MASK 0x8
#define I2C2CONSET_SI 0x8
#define I2C2CONSET_SI_BIT 3
#define I2C2CONSET_STO_MASK 0x10
#define I2C2CONSET_STO 0x10
#define I2C2CONSET_STO_BIT 4
#define I2C2CONSET_STA_MASK 0x20
#define I2C2CONSET_STA 0x20
#define I2C2CONSET_STA_BIT 5
#define I2C2CONSET_I2EN_MASK 0x40
#define I2C2CONSET_I2EN 0x40
#define I2C2CONSET_I2EN_BIT 6

#define I2C2STAT (*(volatile unsigned char *)0x400A0004)
#define I2C2STAT_OFFSET 0x4
#define I2C2STAT_Status_MASK 0xF8
#define I2C2STAT_Status_BIT 3

#define I2C2DAT (*(volatile unsigned char *)0x400A0008)
#define I2C2DAT_OFFSET 0x8

#define I2C2ADR0 (*(volatile unsigned char *)0x400A000C)
#define I2C2ADR0_OFFSET 0xC
#define I2C2ADR0_GC_MASK 0x1
#define I2C2ADR0_GC 0x1
#define I2C2ADR0_GC_BIT 0
#define I2C2ADR0_Address_MASK 0xFE
#define I2C2ADR0_Address_BIT 1

#define I2C2SCLH (*(volatile unsigned short *)0x400A0010)
#define I2C2SCLH_OFFSET 0x10

#define I2C2SCLL (*(volatile unsigned short *)0x400A0014)
#define I2C2SCLL_OFFSET 0x14

#define I2C2CONCLR (*(volatile unsigned char *)0x400A0018)
#define I2C2CONCLR_OFFSET 0x18
#define I2C2CONCLR_AAC_MASK 0x4
#define I2C2CONCLR_AAC 0x4
#define I2C2CONCLR_AAC_BIT 2
#define I2C2CONCLR_SIC_MASK 0x8
#define I2C2CONCLR_SIC 0x8
#define I2C2CONCLR_SIC_BIT 3
#define I2C2CONCLR_STAC_MASK 0x20
#define I2C2CONCLR_STAC 0x20
#define I2C2CONCLR_STAC_BIT 5
#define I2C2CONCLR_I2ENC_MASK 0x40
#define I2C2CONCLR_I2ENC 0x40
#define I2C2CONCLR_I2ENC_BIT 6

#define I2C2MMCTRL (*(volatile unsigned char *)0x400A001C)
#define I2C2MMCTRL_OFFSET 0x1C
#define I2C2MMCTRL_MM_ENA_MASK 0x1
#define I2C2MMCTRL_MM_ENA 0x1
#define I2C2MMCTRL_MM_ENA_BIT 0
#define I2C2MMCTRL_ENA_SCL_MASK 0x2
#define I2C2MMCTRL_ENA_SCL 0x2
#define I2C2MMCTRL_ENA_SCL_BIT 1
#define I2C2MMCTRL_MATCH_ALL_MASK 0x8
#define I2C2MMCTRL_MATCH_ALL 0x8
#define I2C2MMCTRL_MATCH_ALL_BIT 3

#define I2C2ADR1 (*(volatile unsigned char *)0x400A0020)
#define I2C2ADR1_OFFSET 0x20
#define I2C2ADR1_GC_MASK 0x1
#define I2C2ADR1_GC 0x1
#define I2C2ADR1_GC_BIT 0
#define I2C2ADR1_Address_MASK 0xFE
#define I2C2ADR1_Address_BIT 1

#define I2C2ADR2 (*(volatile unsigned char *)0x400A0024)
#define I2C2ADR2_OFFSET 0x24
#define I2C2ADR2_GC_MASK 0x1
#define I2C2ADR2_GC 0x1
#define I2C2ADR2_GC_BIT 0
#define I2C2ADR2_Address_MASK 0xFE
#define I2C2ADR2_Address_BIT 1

