FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define MCCON (*(volatile unsigned long *)0x400B8000)
#define MCCON_OFFSET 0x0
#define MCCON_RUN0_MASK 0x1
#define MCCON_RUN0 0x1
#define MCCON_RUN0_BIT 0
#define MCCON_CENTER0_MASK 0x2
#define MCCON_CENTER0 0x2
#define MCCON_CENTER0_BIT 1
#define MCCON_POLA0_MASK 0x4
#define MCCON_POLA0 0x4
#define MCCON_POLA0_BIT 2
#define MCCON_DTE0_MASK 0x8
#define MCCON_DTE0 0x8
#define MCCON_DTE0_BIT 3
#define MCCON_DISUP0_MASK 0x10
#define MCCON_DISUP0 0x10
#define MCCON_DISUP0_BIT 4
#define MCCON_RUN1_MASK 0x100
#define MCCON_RUN1 0x100
#define MCCON_RUN1_BIT 8
#define MCCON_CENTER1_MASK 0x200
#define MCCON_CENTER1 0x200
#define MCCON_CENTER1_BIT 9
#define MCCON_POLA1_MASK 0x400
#define MCCON_POLA1 0x400
#define MCCON_POLA1_BIT 10
#define MCCON_DTE1_MASK 0x800
#define MCCON_DTE1 0x800
#define MCCON_DTE1_BIT 11
#define MCCON_DISUP1_MASK 0x1000
#define MCCON_DISUP1 0x1000
#define MCCON_DISUP1_BIT 12
#define MCCON_RUN2_MASK 0x10000
#define MCCON_RUN2 0x10000
#define MCCON_RUN2_BIT 16
#define MCCON_CENTER2_MASK 0x20000
#define MCCON_CENTER2 0x20000
#define MCCON_CENTER2_BIT 17
#define MCCON_POLA2_MASK 0x40000
#define MCCON_POLA2 0x40000
#define MCCON_POLA2_BIT 18
#define MCCON_DTE2_MASK 0x80000
#define MCCON_DTE2 0x80000
#define MCCON_DTE2_BIT 19
#define MCCON_DISUP2_MASK 0x100000
#define MCCON_DISUP2 0x100000
#define MCCON_DISUP2_BIT 20
#define MCCON_INVBDC_MASK 0x20000000
#define MCCON_INVBDC 0x20000000
#define MCCON_INVBDC_BIT 29
#define MCCON_ACMODE_MASK 0x40000000
#define MCCON_ACMODE 0x40000000
#define MCCON_ACMODE_BIT 30
#define MCCON_DCMODE_MASK 0x80000000
#define MCCON_DCMODE 0x80000000
#define MCCON_DCMODE_BIT 31

#define MCCON_SET (*(volatile unsigned long *)0x400B8004)
#define MCCON_SET_OFFSET 0x4
#define MCCON_SET_RUN0_MASK 0x1
#define MCCON_SET_RUN0 0x1
#define MCCON_SET_RUN0_BIT 0
#define MCCON_SET_CENTER0_MASK 0x2
#define MCCON_SET_CENTER0 0x2
#define MCCON_SET_CENTER0_BIT 1
#define MCCON_SET_POLA0_MASK 0x4
#define MCCON_SET_POLA0 0x4
#define MCCON_SET_POLA0_BIT 2
#define MCCON_SET_DTE0_MASK 0x8
#define MCCON_SET_DTE0 0x8
#define MCCON_SET_DTE0_BIT 3
#define MCCON_SET_DISUP0_MASK 0x10
#define MCCON_SET_DISUP0 0x10
#define MCCON_SET_DISUP0_BIT 4
#define MCCON_SET_RUN1_MASK 0x100
#define MCCON_SET_RUN1 0x100
#define MCCON_SET_RUN1_BIT 8
#define MCCON_SET_CENTER1_MASK 0x200
#define MCCON_SET_CENTER1 0x200
#define MCCON_SET_CENTER1_BIT 9
#define MCCON_SET_POLA1_MASK 0x400
#define MCCON_SET_POLA1 0x400
#define MCCON_SET_POLA1_BIT 10
#define MCCON_SET_DTE1_MASK 0x800
#define MCCON_SET_DTE1 0x800
#define MCCON_SET_DTE1_BIT 11
#define MCCON_SET_DISUP1_MASK 0x1000
#define MCCON_SET_DISUP1 0x1000
#define MCCON_SET_DISUP1_BIT 12
#define MCCON_SET_RUN2_MASK 0x10000
#define MCCON_SET_RUN2 0x10000
#define MCCON_SET_RUN2_BIT 16
#define MCCON_SET_CENTER2_MASK 0x20000
#define MCCON_SET_CENTER2 0x20000
#define MCCON_SET_CENTER2_BIT 17
#define MCCON_SET_POLA2_MASK 0x40000
#define MCCON_SET_POLA2 0x40000
#define MCCON_SET_POLA2_BIT 18
#define MCCON_SET_DTE2_MASK 0x80000
#define MCCON_SET_DTE2 0x80000
#define MCCON_SET_DTE2_BIT 19
#define MCCON_SET_DISUP2_MASK 0x100000
#define MCCON_SET_DISUP2 0x100000
#define MCCON_SET_DISUP2_BIT 20
#define MCCON_SET_INVBDC_MASK 0x20000000
#define MCCON_SET_INVBDC 0x20000000
#define MCCON_SET_INVBDC_BIT 29
#define MCCON_SET_ACMODE_MASK 0x40000000
#define MCCON_SET_ACMODE 0x40000000
#define MCCON_SET_ACMODE_BIT 30
#define MCCON_SET_DCMODE_MASK 0x80000000
#define MCCON_SET_DCMODE 0x80000000
#define MCCON_SET_DCMODE_BIT 31

#define MCCON_CLR (*(volatile unsigned long *)0x400B8008)
#define MCCON_CLR_OFFSET 0x8
#define MCCON_CLR_RUN0_MASK 0x1
#define MCCON_CLR_RUN0 0x1
#define MCCON_CLR_RUN0_BIT 0
#define MCCON_CLR_CENTER0_MASK 0x2
#define MCCON_CLR_CENTER0 0x2
#define MCCON_CLR_CENTER0_BIT 1
#define MCCON_CLR_POLA0_MASK 0x4
#define MCCON_CLR_POLA0 0x4
#define MCCON_CLR_POLA0_BIT 2
#define MCCON_CLR_DTE0_MASK 0x8
#define MCCON_CLR_DTE0 0x8
#define MCCON_CLR_DTE0_BIT 3
#define MCCON_CLR_DISUP0_MASK 0x10
#define MCCON_CLR_DISUP0 0x10
#define MCCON_CLR_DISUP0_BIT 4
#define MCCON_CLR_RUN1_MASK 0x100
#define MCCON_CLR_RUN1 0x100
#define MCCON_CLR_RUN1_BIT 8
#define MCCON_CLR_CENTER1_MASK 0x200
#define MCCON_CLR_CENTER1 0x200
#define MCCON_CLR_CENTER1_BIT 9
#define MCCON_CLR_POLA1_MASK 0x400
#define MCCON_CLR_POLA1 0x400
#define MCCON_CLR_POLA1_BIT 10
#define MCCON_CLR_DTE1_MASK 0x800
#define MCCON_CLR_DTE1 0x800
#define MCCON_CLR_DTE1_BIT 11
#define MCCON_CLR_DISUP1_MASK 0x1000
#define MCCON_CLR_DISUP1 0x1000
#define MCCON_CLR_DISUP1_BIT 12
#define MCCON_CLR_RUN2_MASK 0x10000
#define MCCON_CLR_RUN2 0x10000
#define MCCON_CLR_RUN2_BIT 16
#define MCCON_CLR_CENTER2_MASK 0x20000
#define MCCON_CLR_CENTER2 0x20000
#define MCCON_CLR_CENTER2_BIT 17
#define MCCON_CLR_POLA2_MASK 0x40000
#define MCCON_CLR_POLA2 0x40000
#define MCCON_CLR_POLA2_BIT 18
#define MCCON_CLR_DTE2_MASK 0x80000
#define MCCON_CLR_DTE2 0x80000
#define MCCON_CLR_DTE2_BIT 19
#define MCCON_CLR_DISUP2_MASK 0x100000
#define MCCON_CLR_DISUP2 0x100000
#define MCCON_CLR_DISUP2_BIT 20
#define MCCON_CLR_INVBDC_MASK 0x20000000
#define MCCON_CLR_INVBDC 0x20000000
#define MCCON_CLR_INVBDC_BIT 29
#define MCCON_CLR_ACMODE_MASK 0x40000000
#define MCCON_CLR_ACMODE 0x40000000
#define MCCON_CLR_ACMODE_BIT 30
#define MCCON_CLR_DCMODE_MASK 0x80000000
#define MCCON_CLR_DCMODE 0x80000000
#define MCCON_CLR_DCMODE_BIT 31

#define MCCAPCON (*(volatile unsigned long *)0x400B800C)
#define MCCAPCON_OFFSET 0xC
#define MCCAPCON_CAP0MCI0_RE_MASK 0x1
#define MCCAPCON_CAP0MCI0_RE 0x1
#define MCCAPCON_CAP0MCI0_RE_BIT 0
#define MCCAPCON_CAP0MCI0_FE_MASK 0x2
#define MCCAPCON_CAP0MCI0_FE 0x2
#define MCCAPCON_CAP0MCI0_FE_BIT 1
#define MCCAPCON_CAP0MCI1_RE_MASK 0x4
#define MCCAPCON_CAP0MCI1_RE 0x4
#define MCCAPCON_CAP0MCI1_RE_BIT 2
#define MCCAPCON_CAP0MCI1_FE_MASK 0x8
#define MCCAPCON_CAP0MCI1_FE 0x8
#define MCCAPCON_CAP0MCI1_FE_BIT 3
#define MCCAPCON_CAP0MCI2_RE_MASK 0x10
#define MCCAPCON_CAP0MCI2_RE 0x10
#define MCCAPCON_CAP0MCI2_RE_BIT 4
#define MCCAPCON_CAP0MCI2_FE_MASK 0x20
#define MCCAPCON_CAP0MCI2_FE 0x20
#define MCCAPCON_CAP0MCI2_FE_BIT 5
#define MCCAPCON_CAP1MCI0_RE_MASK 0x40
#define MCCAPCON_CAP1MCI0_RE 0x40
#define MCCAPCON_CAP1MCI0_RE_BIT 6
#define MCCAPCON_CAP1MCI0_FE_MASK 0x80
#define MCCAPCON_CAP1MCI0_FE 0x80
#define MCCAPCON_CAP1MCI0_FE_BIT 7
#define MCCAPCON_CAP1MCI1_RE_MASK 0x100
#define MCCAPCON_CAP1MCI1_RE 0x100
#define MCCAPCON_CAP1MCI1_RE_BIT 8
#define MCCAPCON_CAP1MCI1_FE_MASK 0x200
#define MCCAPCON_CAP1MCI1_FE 0x200
#define MCCAPCON_CAP1MCI1_FE_BIT 9
#define MCCAPCON_CAP1MCI2_RE_MASK 0x400
#define MCCAPCON_CAP1MCI2_RE 0x400
#define MCCAPCON_CAP1MCI2_RE_BIT 10
#define MCCAPCON_CAP1MCI2_FE_MASK 0x800
#define MCCAPCON_CAP1MCI2_FE 0x800
#define MCCAPCON_CAP1MCI2_FE_BIT 11
#define MCCAPCON_CAP2MCI0_RE_MASK 0x1000
#define MCCAPCON_CAP2MCI0_RE 0x1000
#define MCCAPCON_CAP2MCI0_RE_BIT 12
#define MCCAPCON_CAP2MCI0_FE_MASK 0x2000
#define MCCAPCON_CAP2MCI0_FE 0x2000
#define MCCAPCON_CAP2MCI0_FE_BIT 13
#define MCCAPCON_CAP2MCI1_RE_MASK 0x4000
#define MCCAPCON_CAP2MCI1_RE 0x4000
#define MCCAPCON_CAP2MCI1_RE_BIT 14
#define MCCAPCON_CAP2MCI1_FE_MASK 0x8000
#define MCCAPCON_CAP2MCI1_FE 0x8000
#define MCCAPCON_CAP2MCI1_FE_BIT 15
#define MCCAPCON_CAP2MCI2_RE_MASK 0x10000
#define MCCAPCON_CAP2MCI2_RE 0x10000
#define MCCAPCON_CAP2MCI2_RE_BIT 16
#define MCCAPCON_CAP2MCI2_FE_MASK 0x20000
#define MCCAPCON_CAP2MCI2_FE 0x20000
#define MCCAPCON_CAP2MCI2_FE_BIT 17
#define MCCAPCON_RT0_MASK 0x40000
#define MCCAPCON_RT0 0x40000
#define MCCAPCON_RT0_BIT 18
#define MCCAPCON_RT1_MASK 0x80000
#define MCCAPCON_RT1 0x80000
#define MCCAPCON_RT1_BIT 19
#define MCCAPCON_RT2_MASK 0x100000
#define MCCAPCON_RT2 0x100000
#define MCCAPCON_RT2_BIT 20
#define MCCAPCON_HNFCAP0_MASK 0x200000
#define MCCAPCON_HNFCAP0 0x200000
#define MCCAPCON_HNFCAP0_BIT 21
#define MCCAPCON_HNFCAP1_MASK 0x400000
#define MCCAPCON_HNFCAP1 0x400000
#define MCCAPCON_HNFCAP1_BIT 22
#define MCCAPCON_HNFCAP2_MASK 0x800000
#define MCCAPCON_HNFCAP2 0x800000
#define MCCAPCON_HNFCAP2_BIT 23

#define MCCAPCON_SET (*(volatile unsigned long *)0x400B8010)
#define MCCAPCON_SET_OFFSET 0x10
#define MCCAPCON_SET_CAP0MCI0_RE_MASK 0x1
#define MCCAPCON_SET_CAP0MCI0_RE 0x1
#define MCCAPCON_SET_CAP0MCI0_RE_BIT 0
#define MCCAPCON_SET_CAP0MCI0_FE_MASK 0x2
#define MCCAPCON_SET_CAP0MCI0_FE 0x2
#define MCCAPCON_SET_CAP0MCI0_FE_BIT 1
#define MCCAPCON_SET_CAP0MCI1_RE_MASK 0x4
#define MCCAPCON_SET_CAP0MCI1_RE 0x4
#define MCCAPCON_SET_CAP0MCI1_RE_BIT 2
#define MCCAPCON_SET_CAP0MCI1_FE_MASK 0x8
#define MCCAPCON_SET_CAP0MCI1_FE 0x8
#define MCCAPCON_SET_CAP0MCI1_FE_BIT 3
#define MCCAPCON_SET_CAP0MCI2_RE_MASK 0x10
#define MCCAPCON_SET_CAP0MCI2_RE 0x10
#define MCCAPCON_SET_CAP0MCI2_RE_BIT 4
#define MCCAPCON_SET_CAP0MCI2_FE_MASK 0x20
#define MCCAPCON_SET_CAP0MCI2_FE 0x20
#define MCCAPCON_SET_CAP0MCI2_FE_BIT 5
#define MCCAPCON_SET_CAP1MCI0_RE_MASK 0x40
#define MCCAPCON_SET_CAP1MCI0_RE 0x40
#define MCCAPCON_SET_CAP1MCI0_RE_BIT 6
#define MCCAPCON_SET_CAP1MCI0_FE_MASK 0x80
#define MCCAPCON_SET_CAP1MCI0_FE 0x80
#define MCCAPCON_SET_CAP1MCI0_FE_BIT 7
#define MCCAPCON_SET_CAP1MCI1_RE_MASK 0x100
#define MCCAPCON_SET_CAP1MCI1_RE 0x100
#define MCCAPCON_SET_CAP1MCI1_RE_BIT 8
#define MCCAPCON_SET_CAP1MCI1_FE_MASK 0x200
#define MCCAPCON_SET_CAP1MCI1_FE 0x200
#define MCCAPCON_SET_CAP1MCI1_FE_BIT 9
#define MCCAPCON_SET_CAP1MCI2_RE_MASK 0x400
#define MCCAPCON_SET_CAP1MCI2_RE 0x400
#define MCCAPCON_SET_CAP1MCI2_RE_BIT 10
#define MCCAPCON_SET_CAP1MCI2_FE_MASK 0x800
#define MCCAPCON_SET_CAP1MCI2_FE 0x800
#define MCCAPCON_SET_CAP1MCI2_FE_BIT 11
#define MCCAPCON_SET_CAP2MCI0_RE_MASK 0x1000
#define MCCAPCON_SET_CAP2MCI0_RE 0x1000
#define MCCAPCON_SET_CAP2MCI0_RE_BIT 12
#define MCCAPCON_SET_CAP2MCI0_FE_MASK 0x2000
#define MCCAPCON_SET_CAP2MCI0_FE 0x2000
#define MCCAPCON_SET_CAP2MCI0_FE_BIT 13
#define MCCAPCON_SET_CAP2MCI1_RE_MASK 0x4000
#define MCCAPCON_SET_CAP2MCI1_RE 0x4000
#define MCCAPCON_SET_CAP2MCI1_RE_BIT 14
#define MCCAPCON_SET_CAP2MCI1_FE_MASK 0x8000
#define MCCAPCON_SET_CAP2MCI1_FE 0x8000
#define MCCAPCON_SET_CAP2MCI1_FE_BIT 15
#define MCCAPCON_SET_CAP2MCI2_RE_MASK 0x10000
#define MCCAPCON_SET_CAP2MCI2_RE 0x10000
#define MCCAPCON_SET_CAP2MCI2_RE_BIT 16
#define MCCAPCON_SET_CAP2MCI2_FE_MASK 0x20000
#define MCCAPCON_SET_CAP2MCI2_FE 0x20000
#define MCCAPCON_SET_CAP2MCI2_FE_BIT 17
#define MCCAPCON_SET_RT0_MASK 0x40000
#define MCCAPCON_SET_RT0 0x40000
#define MCCAPCON_SET_RT0_BIT 18
#define MCCAPCON_SET_RT1_MASK 0x80000
#define MCCAPCON_SET_RT1 0x80000
#define MCCAPCON_SET_RT1_BIT 19
#define MCCAPCON_SET_RT2_MASK 0x100000
#define MCCAPCON_SET_RT2 0x100000
#define MCCAPCON_SET_RT2_BIT 20
#define MCCAPCON_SET_HNFCAP0_MASK 0x200000
#define MCCAPCON_SET_HNFCAP0 0x200000
#define MCCAPCON_SET_HNFCAP0_BIT 21
#define MCCAPCON_SET_HNFCAP1_MASK 0x400000
#define MCCAPCON_SET_HNFCAP1 0x400000
#define MCCAPCON_SET_HNFCAP1_BIT 22
#define MCCAPCON_SET_HNFCAP2_MASK 0x800000
#define MCCAPCON_SET_HNFCAP2 0x800000
#define MCCAPCON_SET_HNFCAP2_BIT 23

#define MCCAPCON_CLR (*(volatile unsigned long *)0x400B8014)
#define MCCAPCON_CLR_OFFSET 0x14
#define MCCAPCON_CLR_CAP0MCI0_RE_MASK 0x1
#define MCCAPCON_CLR_CAP0MCI0_RE 0x1
#define MCCAPCON_CLR_CAP0MCI0_RE_BIT 0
#define MCCAPCON_CLR_CAP0MCI0_FE_MASK 0x2
#define MCCAPCON_CLR_CAP0MCI0_FE 0x2
#define MCCAPCON_CLR_CAP0MCI0_FE_BIT 1
#define MCCAPCON_CLR_CAP0MCI1_RE_MASK 0x4
#define MCCAPCON_CLR_CAP0MCI1_RE 0x4
#define MCCAPCON_CLR_CAP0MCI1_RE_BIT 2
#define MCCAPCON_CLR_CAP0MCI1_FE_MASK 0x8
#define MCCAPCON_CLR_CAP0MCI1_FE 0x8
#define MCCAPCON_CLR_CAP0MCI1_FE_BIT 3
#define MCCAPCON_CLR_CAP0MCI2_RE_MASK 0x10
#define MCCAPCON_CLR_CAP0MCI2_RE 0x10
#define MCCAPCON_CLR_CAP0MCI2_RE_BIT 4
#define MCCAPCON_CLR_CAP0MCI2_FE_MASK 0x20
#define MCCAPCON_CLR_CAP0MCI2_FE 0x20
#define MCCAPCON_CLR_CAP0MCI2_FE_BIT 5
#define MCCAPCON_CLR_CAP1MCI0_RE_MASK 0x40
#define MCCAPCON_CLR_CAP1MCI0_RE 0x40
#define MCCAPCON_CLR_CAP1MCI0_RE_BIT 6
#define MCCAPCON_CLR_CAP1MCI0_FE_MASK 0x80
#define MCCAPCON_CLR_CAP1MCI0_FE 0x80
#define MCCAPCON_CLR_CAP1MCI0_FE_BIT 7
#define MCCAPCON_CLR_CAP1MCI1_RE_MASK 0x100
#define MCCAPCON_CLR_CAP1MCI1_RE 0x100
#define MCCAPCON_CLR_CAP1MCI1_RE_BIT 8
#define MCCAPCON_CLR_CAP1MCI1_FE_MASK 0x200
#define MCCAPCON_CLR_CAP1MCI1_FE 0x200
#define MCCAPCON_CLR_CAP1MCI1_FE_BIT 9
#define MCCAPCON_CLR_CAP1MCI2_RE_MASK 0x400
#define MCCAPCON_CLR_CAP1MCI2_RE 0x400
#define MCCAPCON_CLR_CAP1MCI2_RE_BIT 10
#define MCCAPCON_CLR_CAP1MCI2_FE_MASK 0x800
#define MCCAPCON_CLR_CAP1MCI2_FE 0x800
#define MCCAPCON_CLR_CAP1MCI2_FE_BIT 11
#define MCCAPCON_CLR_CAP2MCI0_RE_MASK 0x1000
#define MCCAPCON_CLR_CAP2MCI0_RE 0x1000
#define MCCAPCON_CLR_CAP2MCI0_RE_BIT 12
#define MCCAPCON_CLR_CAP2MCI0_FE_MASK 0x2000
#define MCCAPCON_CLR_CAP2MCI0_FE 0x2000
#define MCCAPCON_CLR_CAP2MCI0_FE_BIT 13
#define MCCAPCON_CLR_CAP2MCI1_RE_MASK 0x4000
#define MCCAPCON_CLR_CAP2MCI1_RE 0x4000
#define MCCAPCON_CLR_CAP2MCI1_RE_BIT 14
#define MCCAPCON_CLR_CAP2MCI1_FE_MASK 0x8000
#define MCCAPCON_CLR_CAP2MCI1_FE 0x8000
#define MCCAPCON_CLR_CAP2MCI1_FE_BIT 15
#define MCCAPCON_CLR_CAP2MCI2_RE_MASK 0x10000
#define MCCAPCON_CLR_CAP2MCI2_RE 0x10000
#define MCCAPCON_CLR_CAP2MCI2_RE_BIT 16
#define MCCAPCON_CLR_CAP2MCI2_FE_MASK 0x20000
#define MCCAPCON_CLR_CAP2MCI2_FE 0x20000
#define MCCAPCON_CLR_CAP2MCI2_FE_BIT 17
#define MCCAPCON_CLR_RT0_MASK 0x40000
#define MCCAPCON_CLR_RT0 0x40000
#define MCCAPCON_CLR_RT0_BIT 18
#define MCCAPCON_CLR_RT1_MASK 0x80000
#define MCCAPCON_CLR_RT1 0x80000
#define MCCAPCON_CLR_RT1_BIT 19
#define MCCAPCON_CLR_RT2_MASK 0x100000
#define MCCAPCON_CLR_RT2 0x100000
#define MCCAPCON_CLR_RT2_BIT 20
#define MCCAPCON_CLR_HNFCAP0_MASK 0x200000
#define MCCAPCON_CLR_HNFCAP0 0x200000
#define MCCAPCON_CLR_HNFCAP0_BIT 21
#define MCCAPCON_CLR_HNFCAP1_MASK 0x400000
#define MCCAPCON_CLR_HNFCAP1 0x400000
#define MCCAPCON_CLR_HNFCAP1_BIT 22
#define MCCAPCON_CLR_HNFCAP2_MASK 0x800000
#define MCCAPCON_CLR_HNFCAP2 0x800000
#define MCCAPCON_CLR_HNFCAP2_BIT 23

#define MCTC0 (*(volatile unsigned long *)0x400B8018)
#define MCTC0_OFFSET 0x18

#define MCTC1 (*(volatile unsigned long *)0x400B801C)
#define MCTC1_OFFSET 0x1C

#define MCTC2 (*(volatile unsigned long *)0x400B8020)
#define MCTC2_OFFSET 0x20

#define MCLIM0 (*(volatile unsigned long *)0x400B8024)
#define MCLIM0_OFFSET 0x24

#define MCLIM1 (*(volatile unsigned long *)0x400B8028)
#define MCLIM1_OFFSET 0x28

