FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define CLRT (*(volatile unsigned *)0x50000010)
#define CLRT_OFFSET 0x10
#define CLRT_RETRANSMISSION_MAXIMUM_MASK 0xF
#define CLRT_RETRANSMISSION_MAXIMUM_BIT 0
#define CLRT_COLLISION_WINDOW_MASK 0x3F00
#define CLRT_COLLISION_WINDOW_BIT 8

#define MAXF (*(volatile unsigned *)0x50000014)
#define MAXF_OFFSET 0x14
#define MAXF_MAXIMUM_FRAME_LENGTH_MASK 0xFFFF
#define MAXF_MAXIMUM_FRAME_LENGTH_BIT 0

#define SUPP (*(volatile unsigned *)0x50000018)
#define SUPP_OFFSET 0x18
#define SUPP_SPEED_MASK 0x100
#define SUPP_SPEED 0x100
#define SUPP_SPEED_BIT 8

#define TEST (*(volatile unsigned *)0x5000001C)
#define TEST_OFFSET 0x1C
#define TEST_SHORTCUT_PAUSE_QUANTA_MASK 0x1
#define TEST_SHORTCUT_PAUSE_QUANTA 0x1
#define TEST_SHORTCUT_PAUSE_QUANTA_BIT 0
#define TEST_TEST_PAUSE_MASK 0x2
#define TEST_TEST_PAUSE 0x2
#define TEST_TEST_PAUSE_BIT 1
#define TEST_TEST_BACKPRESSURE_MASK 0x4
#define TEST_TEST_BACKPRESSURE 0x4
#define TEST_TEST_BACKPRESSURE_BIT 2

#define MCFG (*(volatile unsigned *)0x50000020)
#define MCFG_OFFSET 0x20
#define MCFG_SCAN_INCREMENT_MASK 0x1
#define MCFG_SCAN_INCREMENT 0x1
#define MCFG_SCAN_INCREMENT_BIT 0
#define MCFG_SUPPRESS_PREAMBLE_MASK 0x2
#define MCFG_SUPPRESS_PREAMBLE 0x2
#define MCFG_SUPPRESS_PREAMBLE_BIT 1
#define MCFG_CLOCK_SELECT_MASK 0x1C
#define MCFG_CLOCK_SELECT_BIT 2
#define MCFG_RESET_MII_MGMT_MASK 0x8000
#define MCFG_RESET_MII_MGMT 0x8000
#define MCFG_RESET_MII_MGMT_BIT 15

#define MCMD (*(volatile unsigned *)0x50000024)
#define MCMD_OFFSET 0x24
#define MCMD_READ_MASK 0x1
#define MCMD_READ 0x1
#define MCMD_READ_BIT 0
#define MCMD_SCAN_MASK 0x2
#define MCMD_SCAN 0x2
#define MCMD_SCAN_BIT 1

#define MADR (*(volatile unsigned *)0x50000028)
#define MADR_OFFSET 0x28
#define MADR_REGISTER_ADDRESS_MASK 0x1F
#define MADR_REGISTER_ADDRESS_BIT 0
#define MADR_PHY_ADDRESS_MASK 0x1F00
#define MADR_PHY_ADDRESS_BIT 8

#define MWTD (*(volatile unsigned *)0x5000002C)
#define MWTD_OFFSET 0x2C
#define MWTD_WRITE_DATA_MASK 0xFFFF
#define MWTD_WRITE_DATA_BIT 0

#define MRDD (*(volatile unsigned *)0x50000030)
#define MRDD_OFFSET 0x30
#define MRDD_WRITE_DATA_MASK 0xFFFF
#define MRDD_WRITE_DATA_BIT 0

#define MIND (*(volatile unsigned *)0x50000034)
#define MIND_OFFSET 0x34
#define MIND_BUSY_MASK 0x1
#define MIND_BUSY 0x1
#define MIND_BUSY_BIT 0
#define MIND_SCANNING_MASK 0x2
#define MIND_SCANNING 0x2
#define MIND_SCANNING_BIT 1
#define MIND_NOT_VALID_MASK 0x4
#define MIND_NOT_VALID 0x4
#define MIND_NOT_VALID_BIT 2
#define MIND_MII_Link_Fail_MASK 0x8
#define MIND_MII_Link_Fail 0x8
#define MIND_MII_Link_Fail_BIT 3

#define SA0 (*(volatile unsigned *)0x50000040)
#define SA0_OFFSET 0x40
#define SA0_STATION_ADDRESS_2nd_octet_MASK 0xFF
#define SA0_STATION_ADDRESS_2nd_octet_BIT 0
#define SA0_STATION_ADDRESS_1st_octet_MASK 0xFF00
#define SA0_STATION_ADDRESS_1st_octet_BIT 8

#define SA1 (*(volatile unsigned *)0x50000044)
#define SA1_OFFSET 0x44
#define SA1_STATION_ADDRESS_4th_octet_MASK 0xFF
#define SA1_STATION_ADDRESS_4th_octet_BIT 0
#define SA1_STATION_ADDRESS_3rd_octet_MASK 0xFF00
#define SA1_STATION_ADDRESS_3rd_octet_BIT 8

#define SA2 (*(volatile unsigned *)0x50000048)
#define SA2_OFFSET 0x48
#define SA2_STATION_ADDRESS_6th_octet_MASK 0xFF
#define SA2_STATION_ADDRESS_6th_octet_BIT 0
#define SA2_STATION_ADDRESS_5th_octet_MASK 0xFF00
#define SA2_STATION_ADDRESS_5th_octet_BIT 8

#define Command (*(volatile unsigned *)0x50000100)
#define Command_OFFSET 0x100
#define Command_RxEnable_MASK 0x1
#define Command_RxEnable 0x1
#define Command_RxEnable_BIT 0
#define Command_TxEnable_MASK 0x2
#define Command_TxEnable 0x2
#define Command_TxEnable_BIT 1
#define Command_RegReset_MASK 0x8
#define Command_RegReset 0x8
#define Command_RegReset_BIT 3
#define Command_TxReset_MASK 0x10
#define Command_TxReset 0x10
#define Command_TxReset_BIT 4
#define Command_RxReset_MASK 0x20
#define Command_RxReset 0x20
#define Command_RxReset_BIT 5
#define Command_PassRuntFrame_MASK 0x40
#define Command_PassRuntFrame 0x40
#define Command_PassRuntFrame_BIT 6
#define Command_PassRxFilter_MASK 0x80
#define Command_PassRxFilter 0x80
#define Command_PassRxFilter_BIT 7
#define Command_TxFlowControl_MASK 0x100
#define Command_TxFlowControl 0x100
#define Command_TxFlowControl_BIT 8
#define Command_RMII_MASK 0x200
#define Command_RMII 0x200
#define Command_RMII_BIT 9
#define Command_FullDuplex_MASK 0x400
#define Command_FullDuplex 0x400
#define Command_FullDuplex_BIT 10

#define Status (*(volatile unsigned *)0x50000104)
#define Status_OFFSET 0x104
#define Status_RxStatus_MASK 0x1
#define Status_RxStatus 0x1
#define Status_RxStatus_BIT 0
#define Status_TxStatus_MASK 0x2
#define Status_TxStatus 0x2
#define Status_TxStatus_BIT 1

#define RxDescriptor (*(volatile unsigned *)0x50000108)
#define RxDescriptor_OFFSET 0x108

#define RxStatus (*(volatile unsigned *)0x5000010C)
#define RxStatus_OFFSET 0x10C

#define RxDescriptorNumber (*(volatile unsigned *)0x50000110)
#define RxDescriptorNumber_OFFSET 0x110

#define RxProduceIndex (*(volatile unsigned *)0x50000114)
#define RxProduceIndex_OFFSET 0x114

#define RxConsumeIndex (*(volatile unsigned *)0x50000118)
#define RxConsumeIndex_OFFSET 0x118

#define TxDescriptor (*(volatile unsigned *)0x5000011C)
#define TxDescriptor_OFFSET 0x11C

#define TxStatus (*(volatile unsigned *)0x50000120)
#define TxStatus_OFFSET 0x120

#define TxDescriptorNumber (*(volatile unsigned *)0x50000124)
#define TxDescriptorNumber_OFFSET 0x124

#define TxProduceIndex (*(volatile unsigned *)0x50000128)
#define TxProduceIndex_OFFSET 0x128

#define TxConsumeIndex (*(volatile unsigned *)0x5000012C)
#define TxConsumeIndex_OFFSET 0x12C

#define TSV0 (*(volatile unsigned *)0x50000158)
#define TSV0_OFFSET 0x158
#define TSV0_CRC_error_MASK 0x1
#define TSV0_CRC_error 0x1
#define TSV0_CRC_error_BIT 0
#define TSV0_Length_check_error_MASK 0x2
#define TSV0_Length_check_error 0x2
#define TSV0_Length_check_error_BIT 1
#define TSV0_Length_out_of_range_MASK 0x4
#define TSV0_Length_out_of_range 0x4
#define TSV0_Length_out_of_range_BIT 2
#define TSV0_Done_MASK 0x8
#define TSV0_Done 0x8
#define TSV0_Done_BIT 3
#define TSV0_Multicast_MASK 0x10
#define TSV0_Multicast 0x10
#define TSV0_Multicast_BIT 4
#define TSV0_Broadcast_MASK 0x20
#define TSV0_Broadcast 0x20
#define TSV0_Broadcast_BIT 5
#define TSV0_Packet_Defer_MASK 0x40
#define TSV0_Packet_Defer 0x40
#define TSV0_Packet_Defer_BIT 6
#define TSV0_Excessive_Defer_MASK 0x80
#define TSV0_Excessive_Defer 0x80
#define TSV0_Excessive_Defer_BIT 7
#define TSV0_Excessive_Collison_MASK 0x100
#define TSV0_Excessive_Collison 0x100
#define TSV0_Excessive_Collison_BIT 8
#define TSV0_Late_Collison_MASK 0x200
#define TSV0_Late_Collison 0x200
#define TSV0_Late_Collison_BIT 9
#define TSV0_Giant_MASK 0x400
#define TSV0_Giant 0x400
#define TSV0_Giant_BIT 10
#define TSV0_Underrun_MASK 0x800
#define TSV0_Underrun 0x800
#define TSV0_Underrun_BIT 11
#define TSV0_Total_bytes_MASK 0xFFFF000
#define TSV0_Total_bytes_BIT 12
#define TSV0_Control_frame_MASK 0x10000000
#define TSV0_Control_frame 0x10000000
#define TSV0_Control_frame_BIT 28
#define TSV0_Pause_MASK 0x20000000
#define TSV0_Pause 0x20000000
#define TSV0_Pause_BIT 29
#define TSV0_Backpressure_MASK 0x40000000
#define TSV0_Backpressure 0x40000000
#define TSV0_Backpressure_BIT 30
#define TSV0_VLAN_MASK 0x80000000
#define TSV0_VLAN 0x80000000
#define TSV0_VLAN_BIT 31

#define TSV1 (*(volatile unsigned *)0x5000015C)
#define TSV1_OFFSET 0x15C
#define TSV1_Transmit_byte_count_MASK 0xFFFF
#define TSV1_Transmit_byte_count_BIT 0
#define TSV1_Transmit_collision_count_MASK 0xF0000
#define TSV1_Transmit_collision_count_BIT 16

#define RSV (*(volatile unsigned *)0x50000160)
#define RSV_OFFSET 0x160
#define RSV_Receive_byte_count_MASK 0xFFFF
#define RSV_Receive_byte_count_BIT 0
#define RSV_Packet_previously_ignored_MASK 0x10000
#define RSV_Packet_previously_ignored 0x10000
#define RSV_Packet_previously_ignored_BIT 16
#define RSV_RXDV_event_previously_seen_MASK 0x20000
#define RSV_RXDV_event_previously_seen 0x20000
#define RSV_RXDV_event_previously_seen_BIT 17
#define RSV_Carrier_event_previously_seen_MASK 0x40000
#define RSV_Carrier_event_previously_seen 0x40000
#define RSV_Carrier_event_previously_seen_BIT 18
#define RSV_Receive_code_violation_MASK 0x80000
#define RSV_Receive_code_violation 0x80000
#define RSV_Receive_code_violation_BIT 19
#define RSV_CRC_error_MASK 0x100000
#define RSV_CRC_error 0x100000
#define RSV_CRC_error_BIT 20
#define RSV_Length_check_error_MASK 0x200000
#define RSV_Length_check_error 0x200000
#define RSV_Length_check_error_BIT 21
#define RSV_Length_out_of_range_MASK 0x400000
#define RSV_Length_out_of_range 0x400000
#define RSV_Length_out_of_range_BIT 22
#define RSV_Receive_OK_MASK 0x800000
#define RSV_Receive_OK 0x800000
#define RSV_Receive_OK_BIT 23
#define RSV_Multicast_MASK 0x1000000
#define RSV_Multicast 0x1000000
#define RSV_Multicast_BIT 24
#define RSV_Broadcast_MASK 0x2000000
#define RSV_Broadcast 0x2000000
#define RSV_Broadcast_BIT 25
#define RSV_Dribble_Nibble_MASK 0x4000000
#define RSV_Dribble_Nibble 0x4000000
#define RSV_Dribble_Nibble_BIT 26
#define RSV_Control_frame_MASK 0x8000000
#define RSV_Control_frame 0x8000000
#define RSV_Control_frame_BIT 27
#define RSV_PAUSE_MASK 0x10000000
#define RSV_PAUSE 0x10000000
#define RSV_PAUSE_BIT 28
#define RSV_Unsupported_Opcode_MASK 0x20000000
#define RSV_Unsupported_Opcode 0x20000000
#define RSV_Unsupported_Opcode_BIT 29
#define RSV_VLAN_MASK 0x40000000
#define RSV_VLAN 0x40000000
#define RSV_VLAN_BIT 30

#define FlowControlCounter (*(volatile unsigned *)0x50000170)
#define FlowControlCounter_OFFSET 0x170
#define FlowControlCounter_MirrorCounter_MASK 0xFFFF
#define FlowControlCounter_MirrorCounter_BIT 0
#define FlowControlCounter_Pause_Timer_MASK 0xFFFF0000
#define FlowControlCounter_Pause_Timer_BIT 16

#define FlowControlStatus (*(volatile unsigned *)0x50000174)
#define FlowControlStatus_OFFSET 0x174

#define RxFilterCtrl (*(volatile unsigned *)0x50000200)
#define RxFilterCtrl_OFFSET 0x200
#define RxFilterCtrl_AcceptUnicastEn_MASK 0x1
#define RxFilterCtrl_AcceptUnicastEn 0x1
#define RxFilterCtrl_AcceptUnicastEn_BIT 0
#define RxFilterCtrl_AcceptBroadcastEn_MASK 0x2
#define RxFilterCtrl_AcceptBroadcastEn 0x2
#define RxFilterCtrl_AcceptBroadcastEn_BIT 1
#define RxFilterCtrl_AcceptMulticastEn_MASK 0x4
#define RxFilterCtrl_AcceptMulticastEn 0x4
#define RxFilterCtrl_AcceptMulticastEn_BIT 2
#define RxFilterCtrl_AcceptUnicastHashEn_MASK 0x8
#define RxFilterCtrl_AcceptUnicastHashEn 0x8
#define RxFilterCtrl_AcceptUnicastHashEn_BIT 3
#define RxFilterCtrl_AcceptMulticastHashEn_MASK 0x10
#define RxFilterCtrl_AcceptMulticastHashEn 0x10
#define RxFilterCtrl_AcceptMulticastHashEn_BIT 4
#define RxFilterCtrl_AcceptPerfectEn_MASK 0x20
#define RxFilterCtrl_AcceptPerfectEn 0x20
#define RxFilterCtrl_AcceptPerfectEn_BIT 5
#define RxFilterCtrl_MagicPacketEnWoL_MASK 0x1000
#define RxFilterCtrl_MagicPacketEnWoL 0x1000
#define RxFilterCtrl_MagicPacketEnWoL_BIT 12
#define RxFilterCtrl_RxFilterEnWoL_MASK 0x2000
#define RxFilterCtrl_RxFilterEnWoL 0x2000
#define RxFilterCtrl_RxFilterEnWoL_BIT 13

#define RxFilterWoLStatus (*(volatile unsigned *)0x50000204)
#define RxFilterWoLStatus_OFFSET 0x204
#define RxFilterWoLStatus_AcceptUnicastWoL_MASK 0x1
#define RxFilterWoLStatus_AcceptUnicastWoL 0x1
#define RxFilterWoLStatus_AcceptUnicastWoL_BIT 0
#define RxFilterWoLStatus_AcceptBroadcastWoL_MASK 0x2
#define RxFilterWoLStatus_AcceptBroadcastWoL 0x2
#define RxFilterWoLStatus_AcceptBroadcastWoL_BIT 1
#define RxFilterWoLStatus_AcceptMulticastWoL_MASK 0x4
#define RxFilterWoLStatus_AcceptMulticastWoL 0x4
#define RxFilterWoLStatus_AcceptMulticastWoL_BIT 2
#define RxFilterWoLStatus_AcceptUnicastHashWoL_MASK 0x8
#define RxFilterWoLStatus_AcceptUnicastHashWoL 0x8
#define RxFilterWoLStatus_AcceptUnicastHashWoL_BIT 3
#define RxFilterWoLStatus_AcceptMulticastHashWoL_MASK 0x10
#define RxFilterWoLStatus_AcceptMulticastHashWoL 0x10
#define RxFilterWoLStatus_AcceptMulticastHashWoL_BIT 4
#define RxFilterWoLStatus_AcceptPerfectWoL_MASK 0x20
#define RxFilterWoLStatus_AcceptPerfectWoL 0x20
#define RxFilterWoLStatus_AcceptPerfectWoL_BIT 5
#define RxFilterWoLStatus_RxFilterWoL_MASK 0x80
#define RxFilterWoLStatus_RxFilterWoL 0x80
#define RxFilterWoLStatus_RxFilterWoL_BIT 7
#define RxFilterWoLStatus_MagicPacketWoL_MASK 0x100
#define RxFilterWoLStatus_MagicPacketWoL 0x100
#define RxFilterWoLStatus_MagicPacketWoL_BIT 8

#define RxFilterWoLClear (*(volatile unsigned *)0x50000208)
#define RxFilterWoLClear_OFFSET 0x208
#define RxFilterWoLClear_AcceptUnicastWoLClr_MASK 0x1
#define RxFilterWoLClear_AcceptUnicastWoLClr 0x1
#define RxFilterWoLClear_AcceptUnicastWoLClr_BIT 0
#define RxFilterWoLClear_AcceptBroadcastWoLClr_MASK 0x2
#define RxFilterWoLClear_AcceptBroadcastWoLClr 0x2
#define RxFilterWoLClear_AcceptBroadcastWoLClr_BIT 1
#define RxFilterWoLClear_AcceptMulticastWoLClr_MASK 0x4
#define RxFilterWoLClear_AcceptMulticastWoLClr 0x4
#define RxFilterWoLClear_AcceptMulticastWoLClr_BIT 2
#define RxFilterWoLClear_AcceptUnicastHashWoLClr_MASK 0x8
#define RxFilterWoLClear_AcceptUnicastHashWoLClr 0x8
#define RxFilterWoLClear_AcceptUnicastHashWoLClr_BIT 3
#define RxFilterWoLClear_AcceptMulticastHashWoLClr_MASK 0x10
#define RxFilterWoLClear_AcceptMulticastHashWoLClr 0x10
#define RxFilterWoLClear_AcceptMulticastHashWoLClr_BIT 4
#define RxFilterWoLClear_AcceptPerfectWoLClr_MASK 0x20
#define RxFilterWoLClear_AcceptPerfectWoLClr 0x20
#define RxFilterWoLClear_AcceptPerfectWoLClr_BIT 5
#define RxFilterWoLClear_RxFilterWoLClr_MASK 0x80
#define RxFilterWoLClear_RxFilterWoLClr 0x80
#define RxFilterWoLClear_RxFilterWoLClr_BIT 7
#define RxFilterWoLClear_MagicPacketWoLClr_MASK 0x100
#define RxFilterWoLClear_MagicPacketWoLClr 0x100
#define RxFilterWoLClear_MagicPacketWoLClr_BIT 8

#define HashFilterL (*(volatile unsigned *)0x50000210)
#define HashFilterL_OFFSET 0x210

#define HashFilterH (*(volatile unsigned *)0x50000214)
#define HashFilterH_OFFSET 0x214

#define IntStatus (*(volatile unsigned *)0x50000FE0)
#define IntStatus_OFFSET 0xFE0
#define IntStatus_RxOverrunInt_MASK 0x1
#define IntStatus_RxOverrunInt 0x1
#define IntStatus_RxOverrunInt_BIT 0
#define IntStatus_RxErrorInt_MASK 0x2
#define IntStatus_RxErrorInt 0x2
#define IntStatus_RxErrorInt_BIT 1
#define IntStatus_RxFinishedInt_MASK 0x4
#define IntStatus_RxFinishedInt 0x4
#define IntStatus_RxFinishedInt_BIT 2
#define IntStatus_RxDoneInt_MASK 0x8
#define IntStatus_RxDoneInt 0x8
#define IntStatus_RxDoneInt_BIT 3
#define IntStatus_TxUnderrunInt_MASK 0x10
#define IntStatus_TxUnderrunInt 0x10
#define IntStatus_TxUnderrunInt_BIT 4
#define IntStatus_TxErrorInt_MASK 0x20
#define IntStatus_TxErrorInt 0x20
#define IntStatus_TxErrorInt_BIT 5
#define IntStatus_TxFinishedInt_MASK 0x40
#define IntStatus_TxFinishedInt 0x40
#define IntStatus_TxFinishedInt_BIT 6
#define IntStatus_TxDoneInt_MASK 0x80
#define IntStatus_TxDoneInt 0x80
#define IntStatus_TxDoneInt_BIT 7
#define IntStatus_SoftInt_MASK 0x1000
#define IntStatus_SoftInt 0x1000
#define IntStatus_SoftInt_BIT 12
#define IntStatus_WakeupInt_MASK 0x2000
#define IntStatus_WakeupInt 0x2000
#define IntStatus_WakeupInt_BIT 13

#define IntEnable (*(volatile unsigned *)0x50000FE4)
#define IntEnable_OFFSET 0xFE4
#define IntEnable_RxOverrunIntEn_MASK 0x1
#define IntEnable_RxOverrunIntEn 0x1
#define IntEnable_RxOverrunIntEn_BIT 0
#define IntEnable_RxErrorIntEn_MASK 0x2
#define IntEnable_RxErrorIntEn 0x2
#define IntEnable_RxErrorIntEn_BIT 1
#define IntEnable_RxFinishedIntEn_MASK 0x4
#define IntEnable_RxFinishedIntEn 0x4
#define IntEnable_RxFinishedIntEn_BIT 2
#define IntEnable_RxDoneIntEn_MASK 0x8
#define IntEnable_RxDoneIntEn 0x8
#define IntEnable_RxDoneIntEn_BIT 3
#define IntEnable_TxUnderrunIntEn_MASK 0x10
#define IntEnable_TxUnderrunIntEn 0x10
#define IntEnable_TxUnderrunIntEn_BIT 4
#define IntEnable_TxErrorIntEn_MASK 0x20
#define IntEnable_TxErrorIntEn 0x20
#define IntEnable_TxErrorIntEn_BIT 5
#define IntEnable_TxFinishedIntEn_MASK 0x40
#define IntEnable_TxFinishedIntEn 0x40
#define IntEnable_TxFinishedIntEn_BIT 6
#define IntEnable_TxDoneIntEn_MASK 0x80
#define IntEnable_TxDoneIntEn 0x80
#define IntEnable_TxDoneIntEn_BIT 7
#define IntEnable_SoftIntEn_MASK 0x1000
#define IntEnable_SoftIntEn 0x1000
#define IntEnable_SoftIntEn_BIT 12
#define IntEnable_WakeupIntEn_MASK 0x2000
#define IntEnable_WakeupIntEn 0x2000
#define IntEnable_WakeupIntEn_BIT 13

