FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define HcInterruptDisable (*(volatile unsigned *)0x5000C014)
#define HcInterruptDisable_OFFSET 0x14
#define HcInterruptDisable_SO_MASK 0x1
#define HcInterruptDisable_SO 0x1
#define HcInterruptDisable_SO_BIT 0
#define HcInterruptDisable_WDH_MASK 0x2
#define HcInterruptDisable_WDH 0x2
#define HcInterruptDisable_WDH_BIT 1
#define HcInterruptDisable_SF_MASK 0x4
#define HcInterruptDisable_SF 0x4
#define HcInterruptDisable_SF_BIT 2
#define HcInterruptDisable_RD_MASK 0x8
#define HcInterruptDisable_RD 0x8
#define HcInterruptDisable_RD_BIT 3
#define HcInterruptDisable_UE_MASK 0x10
#define HcInterruptDisable_UE 0x10
#define HcInterruptDisable_UE_BIT 4
#define HcInterruptDisable_FNO_MASK 0x20
#define HcInterruptDisable_FNO 0x20
#define HcInterruptDisable_FNO_BIT 5
#define HcInterruptDisable_RHSC_MASK 0x40
#define HcInterruptDisable_RHSC 0x40
#define HcInterruptDisable_RHSC_BIT 6
#define HcInterruptDisable_OC_MASK 0x40000000
#define HcInterruptDisable_OC 0x40000000
#define HcInterruptDisable_OC_BIT 30
#define HcInterruptDisable_MIE_MASK 0x80000000
#define HcInterruptDisable_MIE 0x80000000
#define HcInterruptDisable_MIE_BIT 31

#define HcHCCA (*(volatile unsigned *)0x5000C018)
#define HcHCCA_OFFSET 0x18
#define HcHCCA_HCCA_MASK 0xFFFFFF00
#define HcHCCA_HCCA_BIT 8

#define HcPeriodCurrentED (*(volatile unsigned *)0x5000C01C)
#define HcPeriodCurrentED_OFFSET 0x1C
#define HcPeriodCurrentED_PCED_MASK 0xFFFFFFF0
#define HcPeriodCurrentED_PCED_BIT 4

#define HcControlHeadED (*(volatile unsigned *)0x5000C020)
#define HcControlHeadED_OFFSET 0x20
#define HcControlHeadED_CHED_MASK 0xFFFFFFF0
#define HcControlHeadED_CHED_BIT 4

#define HcControlCurrentED (*(volatile unsigned *)0x5000C024)
#define HcControlCurrentED_OFFSET 0x24
#define HcControlCurrentED_CCED_MASK 0xFFFFFFF0
#define HcControlCurrentED_CCED_BIT 4

#define HcBulkHeadED (*(volatile unsigned *)0x5000C028)
#define HcBulkHeadED_OFFSET 0x28
#define HcBulkHeadED_BHED_MASK 0xFFFFFFF0
#define HcBulkHeadED_BHED_BIT 4

#define HcBulkCurrentED (*(volatile unsigned *)0x5000C02C)
#define HcBulkCurrentED_OFFSET 0x2C
#define HcBulkCurrentED_BCED_MASK 0xFFFFFFF0
#define HcBulkCurrentED_BCED_BIT 4

#define HcDoneHead (*(volatile unsigned *)0x5000C030)
#define HcDoneHead_OFFSET 0x30
#define HcDoneHead_DH_MASK 0xFFFFFFF0
#define HcDoneHead_DH_BIT 4

#define HcFmInterval (*(volatile unsigned *)0x5000C034)
#define HcFmInterval_OFFSET 0x34
#define HcFmInterval_FI_MASK 0x3FFF
#define HcFmInterval_FI_BIT 0
#define HcFmInterval_FSMPS_MASK 0x7FFF0000
#define HcFmInterval_FSMPS_BIT 16
#define HcFmInterval_FIT_MASK 0x80000000
#define HcFmInterval_FIT 0x80000000
#define HcFmInterval_FIT_BIT 31

#define HcFmRemaining (*(volatile unsigned *)0x5000C038)
#define HcFmRemaining_OFFSET 0x38
#define HcFmRemaining_FR_MASK 0x3FFF
#define HcFmRemaining_FR_BIT 0
#define HcFmRemaining_FRT_MASK 0x80000000
#define HcFmRemaining_FRT 0x80000000
#define HcFmRemaining_FRT_BIT 31

#define HcFmNumber (*(volatile unsigned *)0x5000C03C)
#define HcFmNumber_OFFSET 0x3C
#define HcFmNumber_FN_MASK 0xFFFF
#define HcFmNumber_FN_BIT 0

#define HcPeriodicStart (*(volatile unsigned *)0x5000C040)
#define HcPeriodicStart_OFFSET 0x40
#define HcPeriodicStart_PS_MASK 0x3FFF
#define HcPeriodicStart_PS_BIT 0

#define HcLSThreshold (*(volatile unsigned *)0x5000C044)
#define HcLSThreshold_OFFSET 0x44
#define HcLSThreshold_LST_MASK 0xFFF
#define HcLSThreshold_LST_BIT 0

#define HcRhDescriptorA (*(volatile unsigned *)0x5000C048)
#define HcRhDescriptorA_OFFSET 0x48
#define HcRhDescriptorA_NDP_MASK 0xFF
#define HcRhDescriptorA_NDP_BIT 0
#define HcRhDescriptorA_PSM_MASK 0x100
#define HcRhDescriptorA_PSM 0x100
#define HcRhDescriptorA_PSM_BIT 8
#define HcRhDescriptorA_NPS_MASK 0x200
#define HcRhDescriptorA_NPS 0x200
#define HcRhDescriptorA_NPS_BIT 9
#define HcRhDescriptorA_DT_MASK 0x400
#define HcRhDescriptorA_DT 0x400
#define HcRhDescriptorA_DT_BIT 10
#define HcRhDescriptorA_OCPM_MASK 0x800
#define HcRhDescriptorA_OCPM 0x800
#define HcRhDescriptorA_OCPM_BIT 11
#define HcRhDescriptorA_NOCP_MASK 0x1000
#define HcRhDescriptorA_NOCP 0x1000
#define HcRhDescriptorA_NOCP_BIT 12
#define HcRhDescriptorA_POTPGT_MASK 0xFF000000
#define HcRhDescriptorA_POTPGT_BIT 24

#define HcRhDescriptorB (*(volatile unsigned *)0x5000C04C)
#define HcRhDescriptorB_OFFSET 0x4C
#define HcRhDescriptorB_DR_MASK 0xFFFF
#define HcRhDescriptorB_DR_BIT 0
#define HcRhDescriptorB_PPCM_MASK 0xFFFF0000
#define HcRhDescriptorB_PPCM_BIT 16

#define HcRhStatus (*(volatile unsigned *)0x5000C050)
#define HcRhStatus_OFFSET 0x50
#define HcRhStatus_LPS_MASK 0x1
#define HcRhStatus_LPS 0x1
#define HcRhStatus_LPS_BIT 0
#define HcRhStatus_OCI_MASK 0x2
#define HcRhStatus_OCI 0x2
#define HcRhStatus_OCI_BIT 1
#define HcRhStatus_DRWE_MASK 0x8000
#define HcRhStatus_DRWE 0x8000
#define HcRhStatus_DRWE_BIT 15
#define HcRhStatus_LPSC_MASK 0x10000
#define HcRhStatus_LPSC 0x10000
#define HcRhStatus_LPSC_BIT 16
#define HcRhStatus_OCIC_MASK 0x20000
#define HcRhStatus_OCIC 0x20000
#define HcRhStatus_OCIC_BIT 17
#define HcRhStatus_CRWE_MASK 0x80000000
#define HcRhStatus_CRWE 0x80000000
#define HcRhStatus_CRWE_BIT 31

#define HcRhPortStatus1 (*(volatile unsigned *)0x5000C054)
#define HcRhPortStatus1_OFFSET 0x54
#define HcRhPortStatus1_CCS_MASK 0x1
#define HcRhPortStatus1_CCS 0x1
#define HcRhPortStatus1_CCS_BIT 0
#define HcRhPortStatus1_PES_MASK 0x2
#define HcRhPortStatus1_PES 0x2
#define HcRhPortStatus1_PES_BIT 1
#define HcRhPortStatus1_PSS_MASK 0x4
#define HcRhPortStatus1_PSS 0x4
#define HcRhPortStatus1_PSS_BIT 2
#define HcRhPortStatus1_POCI_MASK 0x8
#define HcRhPortStatus1_POCI 0x8
#define HcRhPortStatus1_POCI_BIT 3
#define HcRhPortStatus1_PRS_MASK 0x10
#define HcRhPortStatus1_PRS 0x10
#define HcRhPortStatus1_PRS_BIT 4
#define HcRhPortStatus1_PPS_MASK 0x100
#define HcRhPortStatus1_PPS 0x100
#define HcRhPortStatus1_PPS_BIT 8
#define HcRhPortStatus1_LSDA_MASK 0x200
#define HcRhPortStatus1_LSDA 0x200
#define HcRhPortStatus1_LSDA_BIT 9
#define HcRhPortStatus1_CSC_MASK 0x10000
#define HcRhPortStatus1_CSC 0x10000
#define HcRhPortStatus1_CSC_BIT 16
#define HcRhPortStatus1_PESC_MASK 0x20000
#define HcRhPortStatus1_PESC 0x20000
#define HcRhPortStatus1_PESC_BIT 17
#define HcRhPortStatus1_PSSC_MASK 0x40000
#define HcRhPortStatus1_PSSC 0x40000
#define HcRhPortStatus1_PSSC_BIT 18
#define HcRhPortStatus1_OCIC_MASK 0x80000
#define HcRhPortStatus1_OCIC 0x80000
#define HcRhPortStatus1_OCIC_BIT 19
#define HcRhPortStatus1_PRSC_MASK 0x100000
#define HcRhPortStatus1_PRSC 0x100000
#define HcRhPortStatus1_PRSC_BIT 20

#define HcRhPortStatus2 (*(volatile unsigned *)0x5000C058)
#define HcRhPortStatus2_OFFSET 0x58
#define HcRhPortStatus2_CCS_MASK 0x1
#define HcRhPortStatus2_CCS 0x1
#define HcRhPortStatus2_CCS_BIT 0
#define HcRhPortStatus2_PES_MASK 0x2
#define HcRhPortStatus2_PES 0x2
#define HcRhPortStatus2_PES_BIT 1
#define HcRhPortStatus2_PSS_MASK 0x4
#define HcRhPortStatus2_PSS 0x4
#define HcRhPortStatus2_PSS_BIT 2
#define HcRhPortStatus2_POCI_MASK 0x8
#define HcRhPortStatus2_POCI 0x8
#define HcRhPortStatus2_POCI_BIT 3
#define HcRhPortStatus2_PRS_MASK 0x10
#define HcRhPortStatus2_PRS 0x10
#define HcRhPortStatus2_PRS_BIT 4
#define HcRhPortStatus2_PPS_MASK 0x100
#define HcRhPortStatus2_PPS 0x100
#define HcRhPortStatus2_PPS_BIT 8
#define HcRhPortStatus2_LSDA_MASK 0x200
#define HcRhPortStatus2_LSDA 0x200
#define HcRhPortStatus2_LSDA_BIT 9
#define HcRhPortStatus2_CSC_MASK 0x10000
#define HcRhPortStatus2_CSC 0x10000
#define HcRhPortStatus2_CSC_BIT 16
#define HcRhPortStatus2_PESC_MASK 0x20000
#define HcRhPortStatus2_PESC 0x20000
#define HcRhPortStatus2_PESC_BIT 17
#define HcRhPortStatus2_PSSC_MASK 0x40000
#define HcRhPortStatus2_PSSC 0x40000
#define HcRhPortStatus2_PSSC_BIT 18
#define HcRhPortStatus2_OCIC_MASK 0x80000
#define HcRhPortStatus2_OCIC 0x80000
#define HcRhPortStatus2_OCIC_BIT 19
#define HcRhPortStatus2_PRSC_MASK 0x100000
#define HcRhPortStatus2_PRSC 0x100000
#define HcRhPortStatus2_PRSC_BIT 20

