FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define NVIC_IPR13 (*(volatile unsigned *)0xE000E434)
#define Irq_52_to_55_Priority NVIC_IPR13
#define NVIC_IPR13_OFFSET 0x334
#define Irq_52_to_55_Priority_OFFSET NVIC_IPR13_OFFSET
#define NVIC_IPR13_PRI_52_MASK 0xFF
#define Irq_52_to_55_Priority_PRI_52_MASK NVIC_IPR13_PRI_52_MASK
#define NVIC_IPR13_PRI_52_BIT 0
#define Irq_52_to_55_Priority_PRI_52_BIT NVIC_IPR13_PRI_52_BIT
#define NVIC_IPR13_PRI_53_MASK 0xFF00
#define Irq_52_to_55_Priority_PRI_53_MASK NVIC_IPR13_PRI_53_MASK
#define NVIC_IPR13_PRI_53_BIT 8
#define Irq_52_to_55_Priority_PRI_53_BIT NVIC_IPR13_PRI_53_BIT
#define NVIC_IPR13_PRI_54_MASK 0xFF0000
#define Irq_52_to_55_Priority_PRI_54_MASK NVIC_IPR13_PRI_54_MASK
#define NVIC_IPR13_PRI_54_BIT 16
#define Irq_52_to_55_Priority_PRI_54_BIT NVIC_IPR13_PRI_54_BIT
#define NVIC_IPR13_PRI_55_MASK 0xFF000000
#define Irq_52_to_55_Priority_PRI_55_MASK NVIC_IPR13_PRI_55_MASK
#define NVIC_IPR13_PRI_55_BIT 24
#define Irq_52_to_55_Priority_PRI_55_BIT NVIC_IPR13_PRI_55_BIT

#define NVIC_IPR14 (*(volatile unsigned *)0xE000E438)
#define Irq_56_to_59_Priority NVIC_IPR14
#define NVIC_IPR14_OFFSET 0x338
#define Irq_56_to_59_Priority_OFFSET NVIC_IPR14_OFFSET
#define NVIC_IPR14_PRI_56_MASK 0xFF
#define Irq_56_to_59_Priority_PRI_56_MASK NVIC_IPR14_PRI_56_MASK
#define NVIC_IPR14_PRI_56_BIT 0
#define Irq_56_to_59_Priority_PRI_56_BIT NVIC_IPR14_PRI_56_BIT
#define NVIC_IPR14_PRI_57_MASK 0xFF00
#define Irq_56_to_59_Priority_PRI_57_MASK NVIC_IPR14_PRI_57_MASK
#define NVIC_IPR14_PRI_57_BIT 8
#define Irq_56_to_59_Priority_PRI_57_BIT NVIC_IPR14_PRI_57_BIT
#define NVIC_IPR14_PRI_58_MASK 0xFF0000
#define Irq_56_to_59_Priority_PRI_58_MASK NVIC_IPR14_PRI_58_MASK
#define NVIC_IPR14_PRI_58_BIT 16
#define Irq_56_to_59_Priority_PRI_58_BIT NVIC_IPR14_PRI_58_BIT
#define NVIC_IPR14_PRI_59_MASK 0xFF000000
#define Irq_56_to_59_Priority_PRI_59_MASK NVIC_IPR14_PRI_59_MASK
#define NVIC_IPR14_PRI_59_BIT 24
#define Irq_56_to_59_Priority_PRI_59_BIT NVIC_IPR14_PRI_59_BIT

#define NVIC_IPR15 (*(volatile unsigned *)0xE000E43C)
#define Irq_60_to_63_Priority NVIC_IPR15
#define NVIC_IPR15_OFFSET 0x33C
#define Irq_60_to_63_Priority_OFFSET NVIC_IPR15_OFFSET
#define NVIC_IPR15_PRI_60_MASK 0xFF
#define Irq_60_to_63_Priority_PRI_60_MASK NVIC_IPR15_PRI_60_MASK
#define NVIC_IPR15_PRI_60_BIT 0
#define Irq_60_to_63_Priority_PRI_60_BIT NVIC_IPR15_PRI_60_BIT
#define NVIC_IPR15_PRI_61_MASK 0xFF00
#define Irq_60_to_63_Priority_PRI_61_MASK NVIC_IPR15_PRI_61_MASK
#define NVIC_IPR15_PRI_61_BIT 8
#define Irq_60_to_63_Priority_PRI_61_BIT NVIC_IPR15_PRI_61_BIT
#define NVIC_IPR15_PRI_62_MASK 0xFF0000
#define Irq_60_to_63_Priority_PRI_62_MASK NVIC_IPR15_PRI_62_MASK
#define NVIC_IPR15_PRI_62_BIT 16
#define Irq_60_to_63_Priority_PRI_62_BIT NVIC_IPR15_PRI_62_BIT
#define NVIC_IPR15_PRI_63_MASK 0xFF000000
#define Irq_60_to_63_Priority_PRI_63_MASK NVIC_IPR15_PRI_63_MASK
#define NVIC_IPR15_PRI_63_BIT 24
#define Irq_60_to_63_Priority_PRI_63_BIT NVIC_IPR15_PRI_63_BIT

#define NVIC_IPR16 (*(volatile unsigned *)0xE000E440)
#define Irq_64_to_67_Priority NVIC_IPR16
#define NVIC_IPR16_OFFSET 0x340
#define Irq_64_to_67_Priority_OFFSET NVIC_IPR16_OFFSET
#define NVIC_IPR16_PRI_64_MASK 0xFF
#define Irq_64_to_67_Priority_PRI_64_MASK NVIC_IPR16_PRI_64_MASK
#define NVIC_IPR16_PRI_64_BIT 0
#define Irq_64_to_67_Priority_PRI_64_BIT NVIC_IPR16_PRI_64_BIT
#define NVIC_IPR16_PRI_65_MASK 0xFF00
#define Irq_64_to_67_Priority_PRI_65_MASK NVIC_IPR16_PRI_65_MASK
#define NVIC_IPR16_PRI_65_BIT 8
#define Irq_64_to_67_Priority_PRI_65_BIT NVIC_IPR16_PRI_65_BIT
#define NVIC_IPR16_PRI_66_MASK 0xFF0000
#define Irq_64_to_67_Priority_PRI_66_MASK NVIC_IPR16_PRI_66_MASK
#define NVIC_IPR16_PRI_66_BIT 16
#define Irq_64_to_67_Priority_PRI_66_BIT NVIC_IPR16_PRI_66_BIT
#define NVIC_IPR16_PRI_67_MASK 0xFF000000
#define Irq_64_to_67_Priority_PRI_67_MASK NVIC_IPR16_PRI_67_MASK
#define NVIC_IPR16_PRI_67_BIT 24
#define Irq_64_to_67_Priority_PRI_67_BIT NVIC_IPR16_PRI_67_BIT

#define NVIC_IPR17 (*(volatile unsigned *)0xE000E444)
#define Irq_68_to_71_Priority NVIC_IPR17
#define NVIC_IPR17_OFFSET 0x344
#define Irq_68_to_71_Priority_OFFSET NVIC_IPR17_OFFSET
#define NVIC_IPR17_PRI_68_MASK 0xFF
#define Irq_68_to_71_Priority_PRI_68_MASK NVIC_IPR17_PRI_68_MASK
#define NVIC_IPR17_PRI_68_BIT 0
#define Irq_68_to_71_Priority_PRI_68_BIT NVIC_IPR17_PRI_68_BIT
#define NVIC_IPR17_PRI_69_MASK 0xFF00
#define Irq_68_to_71_Priority_PRI_69_MASK NVIC_IPR17_PRI_69_MASK
#define NVIC_IPR17_PRI_69_BIT 8
#define Irq_68_to_71_Priority_PRI_69_BIT NVIC_IPR17_PRI_69_BIT
#define NVIC_IPR17_PRI_70_MASK 0xFF0000
#define Irq_68_to_71_Priority_PRI_70_MASK NVIC_IPR17_PRI_70_MASK
#define NVIC_IPR17_PRI_70_BIT 16
#define Irq_68_to_71_Priority_PRI_70_BIT NVIC_IPR17_PRI_70_BIT
#define NVIC_IPR17_PRI_71_MASK 0xFF000000
#define Irq_68_to_71_Priority_PRI_71_MASK NVIC_IPR17_PRI_71_MASK
#define NVIC_IPR17_PRI_71_BIT 24
#define Irq_68_to_71_Priority_PRI_71_BIT NVIC_IPR17_PRI_71_BIT

#define NVIC_IPR18 (*(volatile unsigned *)0xE000E448)
#define Irq_72_to_75_Priority NVIC_IPR18
#define NVIC_IPR18_OFFSET 0x348
#define Irq_72_to_75_Priority_OFFSET NVIC_IPR18_OFFSET
#define NVIC_IPR18_PRI_72_MASK 0xFF
#define Irq_72_to_75_Priority_PRI_72_MASK NVIC_IPR18_PRI_72_MASK
#define NVIC_IPR18_PRI_72_BIT 0
#define Irq_72_to_75_Priority_PRI_72_BIT NVIC_IPR18_PRI_72_BIT
#define NVIC_IPR18_PRI_73_MASK 0xFF00
#define Irq_72_to_75_Priority_PRI_73_MASK NVIC_IPR18_PRI_73_MASK
#define NVIC_IPR18_PRI_73_BIT 8
#define Irq_72_to_75_Priority_PRI_73_BIT NVIC_IPR18_PRI_73_BIT
#define NVIC_IPR18_PRI_74_MASK 0xFF0000
#define Irq_72_to_75_Priority_PRI_74_MASK NVIC_IPR18_PRI_74_MASK
#define NVIC_IPR18_PRI_74_BIT 16
#define Irq_72_to_75_Priority_PRI_74_BIT NVIC_IPR18_PRI_74_BIT
#define NVIC_IPR18_PRI_75_MASK 0xFF000000
#define Irq_72_to_75_Priority_PRI_75_MASK NVIC_IPR18_PRI_75_MASK
#define NVIC_IPR18_PRI_75_BIT 24
#define Irq_72_to_75_Priority_PRI_75_BIT NVIC_IPR18_PRI_75_BIT

#define NVIC_IPR19 (*(volatile unsigned *)0xE000E44C)
#define Irq_76_to_79_Priority NVIC_IPR19
#define NVIC_IPR19_OFFSET 0x34C
#define Irq_76_to_79_Priority_OFFSET NVIC_IPR19_OFFSET
#define NVIC_IPR19_PRI_76_MASK 0xFF
#define Irq_76_to_79_Priority_PRI_76_MASK NVIC_IPR19_PRI_76_MASK
#define NVIC_IPR19_PRI_76_BIT 0
#define Irq_76_to_79_Priority_PRI_76_BIT NVIC_IPR19_PRI_76_BIT
#define NVIC_IPR19_PRI_77_MASK 0xFF00
#define Irq_76_to_79_Priority_PRI_77_MASK NVIC_IPR19_PRI_77_MASK
#define NVIC_IPR19_PRI_77_BIT 8
#define Irq_76_to_79_Priority_PRI_77_BIT NVIC_IPR19_PRI_77_BIT
#define NVIC_IPR19_PRI_78_MASK 0xFF0000
#define Irq_76_to_79_Priority_PRI_78_MASK NVIC_IPR19_PRI_78_MASK
#define NVIC_IPR19_PRI_78_BIT 16
#define Irq_76_to_79_Priority_PRI_78_BIT NVIC_IPR19_PRI_78_BIT
#define NVIC_IPR19_PRI_79_MASK 0xFF000000
#define Irq_76_to_79_Priority_PRI_79_MASK NVIC_IPR19_PRI_79_MASK
#define NVIC_IPR19_PRI_79_BIT 24
#define Irq_76_to_79_Priority_PRI_79_BIT NVIC_IPR19_PRI_79_BIT

