FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define SCB_SHPR3 (*(volatile unsigned *)0xE000ED20)
#define System_Handlers_12_15_Priority SCB_SHPR3
#define SCB_SHPR3_OFFSET 0x20
#define System_Handlers_12_15_Priority_OFFSET SCB_SHPR3_OFFSET
#define SCB_SHPR3_PRI_12_MASK 0xFF
#define System_Handlers_12_15_Priority_PRI_12_MASK SCB_SHPR3_PRI_12_MASK
#define SCB_SHPR3_PRI_12_BIT 0
#define System_Handlers_12_15_Priority_PRI_12_BIT SCB_SHPR3_PRI_12_BIT
#define SCB_SHPR3_PRI_13_MASK 0xFF00
#define System_Handlers_12_15_Priority_PRI_13_MASK SCB_SHPR3_PRI_13_MASK
#define SCB_SHPR3_PRI_13_BIT 8
#define System_Handlers_12_15_Priority_PRI_13_BIT SCB_SHPR3_PRI_13_BIT
#define SCB_SHPR3_PRI_14_MASK 0xFF0000
#define System_Handlers_12_15_Priority_PRI_14_MASK SCB_SHPR3_PRI_14_MASK
#define SCB_SHPR3_PRI_14_BIT 16
#define System_Handlers_12_15_Priority_PRI_14_BIT SCB_SHPR3_PRI_14_BIT
#define SCB_SHPR3_PRI_15_MASK 0xFF000000
#define System_Handlers_12_15_Priority_PRI_15_MASK SCB_SHPR3_PRI_15_MASK
#define SCB_SHPR3_PRI_15_BIT 24
#define System_Handlers_12_15_Priority_PRI_15_BIT SCB_SHPR3_PRI_15_BIT

#define SCB_SHP0 (*(volatile unsigned char *)0xE000ED18)
#define SCB_SHP0_OFFSET 0x18

#define SCB_SHP1 (*(volatile unsigned char *)0xE000ED19)
#define SCB_SHP1_OFFSET 0x19

#define SCB_SHP2 (*(volatile unsigned char *)0xE000ED1A)
#define SCB_SHP2_OFFSET 0x1A

#define SCB_SHP3 (*(volatile unsigned char *)0xE000ED1B)
#define SCB_SHP3_OFFSET 0x1B

#define SCB_SHP4 (*(volatile unsigned char *)0xE000ED1C)
#define SCB_SHP4_OFFSET 0x1C

#define SCB_SHP5 (*(volatile unsigned char *)0xE000ED1D)
#define SCB_SHP5_OFFSET 0x1D

#define SCB_SHP6 (*(volatile unsigned char *)0xE000ED1E)
#define SCB_SHP6_OFFSET 0x1E

#define SCB_SHP7 (*(volatile unsigned char *)0xE000ED1F)
#define SCB_SHP7_OFFSET 0x1F

#define SCB_SHP8 (*(volatile unsigned char *)0xE000ED20)
#define SCB_SHP8_OFFSET 0x20

#define SCB_SHP9 (*(volatile unsigned char *)0xE000ED21)
#define SCB_SHP9_OFFSET 0x21

#define SCB_SHP10 (*(volatile unsigned char *)0xE000ED22)
#define SCB_SHP10_OFFSET 0x22

#define SCB_SHP11 (*(volatile unsigned char *)0xE000ED23)
#define SCB_SHP11_OFFSET 0x23

#define SCB_SHCRS (*(volatile unsigned *)0xE000ED24)
#define System_Handler_Control_and_State SCB_SHCRS
#define SCB_SHCRS_OFFSET 0x24
#define System_Handler_Control_and_State_OFFSET SCB_SHCRS_OFFSET
#define SCB_SHCRS_USGFAULTENA_MASK 0x40000
#define System_Handler_Control_and_State_USGFAULTENA_MASK SCB_SHCRS_USGFAULTENA_MASK
#define SCB_SHCRS_USGFAULTENA 0x40000
#define System_Handler_Control_and_State_USGFAULTENA SCB_SHCRS_USGFAULTENA
#define SCB_SHCRS_USGFAULTENA_BIT 18
#define System_Handler_Control_and_State_USGFAULTENA_BIT SCB_SHCRS_USGFAULTENA_BIT
#define SCB_SHCRS_BUSFAULTENA_MASK 0x20000
#define System_Handler_Control_and_State_BUSFAULTENA_MASK SCB_SHCRS_BUSFAULTENA_MASK
#define SCB_SHCRS_BUSFAULTENA 0x20000
#define System_Handler_Control_and_State_BUSFAULTENA SCB_SHCRS_BUSFAULTENA
#define SCB_SHCRS_BUSFAULTENA_BIT 17
#define System_Handler_Control_and_State_BUSFAULTENA_BIT SCB_SHCRS_BUSFAULTENA_BIT
#define SCB_SHCRS_MEMFAULTENA_MASK 0x10000
#define System_Handler_Control_and_State_MEMFAULTENA_MASK SCB_SHCRS_MEMFAULTENA_MASK
#define SCB_SHCRS_MEMFAULTENA 0x10000
#define System_Handler_Control_and_State_MEMFAULTENA SCB_SHCRS_MEMFAULTENA
#define SCB_SHCRS_MEMFAULTENA_BIT 16
#define System_Handler_Control_and_State_MEMFAULTENA_BIT SCB_SHCRS_MEMFAULTENA_BIT
#define SCB_SHCRS_SVCALLPENDED_MASK 0x8000
#define System_Handler_Control_and_State_SVCALLPENDED_MASK SCB_SHCRS_SVCALLPENDED_MASK
#define SCB_SHCRS_SVCALLPENDED 0x8000
#define System_Handler_Control_and_State_SVCALLPENDED SCB_SHCRS_SVCALLPENDED
#define SCB_SHCRS_SVCALLPENDED_BIT 15
#define System_Handler_Control_and_State_SVCALLPENDED_BIT SCB_SHCRS_SVCALLPENDED_BIT
#define SCB_SHCRS_BUSFAULTPENDED_MASK 0x4000
#define System_Handler_Control_and_State_BUSFAULTPENDED_MASK SCB_SHCRS_BUSFAULTPENDED_MASK
#define SCB_SHCRS_BUSFAULTPENDED 0x4000
#define System_Handler_Control_and_State_BUSFAULTPENDED SCB_SHCRS_BUSFAULTPENDED
#define SCB_SHCRS_BUSFAULTPENDED_BIT 14
#define System_Handler_Control_and_State_BUSFAULTPENDED_BIT SCB_SHCRS_BUSFAULTPENDED_BIT
#define SCB_SHCRS_MEMFAULTPENDED_MASK 0x2000
#define System_Handler_Control_and_State_MEMFAULTPENDED_MASK SCB_SHCRS_MEMFAULTPENDED_MASK
#define SCB_SHCRS_MEMFAULTPENDED 0x2000
#define System_Handler_Control_and_State_MEMFAULTPENDED SCB_SHCRS_MEMFAULTPENDED
#define SCB_SHCRS_MEMFAULTPENDED_BIT 13
#define System_Handler_Control_and_State_MEMFAULTPENDED_BIT SCB_SHCRS_MEMFAULTPENDED_BIT
#define SCB_SHCRS_USGFAULTPENDED_MASK 0x1000
#define System_Handler_Control_and_State_USGFAULTPENDED_MASK SCB_SHCRS_USGFAULTPENDED_MASK
#define SCB_SHCRS_USGFAULTPENDED 0x1000
#define System_Handler_Control_and_State_USGFAULTPENDED SCB_SHCRS_USGFAULTPENDED
#define SCB_SHCRS_USGFAULTPENDED_BIT 12
#define System_Handler_Control_and_State_USGFAULTPENDED_BIT SCB_SHCRS_USGFAULTPENDED_BIT
#define SCB_SHCRS_SYSTICKACT_MASK 0x800
#define System_Handler_Control_and_State_SYSTICKACT_MASK SCB_SHCRS_SYSTICKACT_MASK
#define SCB_SHCRS_SYSTICKACT 0x800
#define System_Handler_Control_and_State_SYSTICKACT SCB_SHCRS_SYSTICKACT
#define SCB_SHCRS_SYSTICKACT_BIT 11
#define System_Handler_Control_and_State_SYSTICKACT_BIT SCB_SHCRS_SYSTICKACT_BIT
#define SCB_SHCRS_PENDSVACT_MASK 0x400
#define System_Handler_Control_and_State_PENDSVACT_MASK SCB_SHCRS_PENDSVACT_MASK
#define SCB_SHCRS_PENDSVACT 0x400
#define System_Handler_Control_and_State_PENDSVACT SCB_SHCRS_PENDSVACT
#define SCB_SHCRS_PENDSVACT_BIT 10
#define System_Handler_Control_and_State_PENDSVACT_BIT SCB_SHCRS_PENDSVACT_BIT
#define SCB_SHCRS_MONITORACT_MASK 0x100
#define System_Handler_Control_and_State_MONITORACT_MASK SCB_SHCRS_MONITORACT_MASK
#define SCB_SHCRS_MONITORACT 0x100
#define System_Handler_Control_and_State_MONITORACT SCB_SHCRS_MONITORACT
#define SCB_SHCRS_MONITORACT_BIT 8
#define System_Handler_Control_and_State_MONITORACT_BIT SCB_SHCRS_MONITORACT_BIT
#define SCB_SHCRS_SVCALLACT_MASK 0x80
#define System_Handler_Control_and_State_SVCALLACT_MASK SCB_SHCRS_SVCALLACT_MASK
#define SCB_SHCRS_SVCALLACT 0x80
#define System_Handler_Control_and_State_SVCALLACT SCB_SHCRS_SVCALLACT
#define SCB_SHCRS_SVCALLACT_BIT 7
#define System_Handler_Control_and_State_SVCALLACT_BIT SCB_SHCRS_SVCALLACT_BIT
#define SCB_SHCRS_USGFAULTACT_MASK 0x8
#define System_Handler_Control_and_State_USGFAULTACT_MASK SCB_SHCRS_USGFAULTACT_MASK
#define SCB_SHCRS_USGFAULTACT 0x8
#define System_Handler_Control_and_State_USGFAULTACT SCB_SHCRS_USGFAULTACT
#define SCB_SHCRS_USGFAULTACT_BIT 3
#define System_Handler_Control_and_State_USGFAULTACT_BIT SCB_SHCRS_USGFAULTACT_BIT
#define SCB_SHCRS_BUSFAULTACT_MASK 0x2
#define System_Handler_Control_and_State_BUSFAULTACT_MASK SCB_SHCRS_BUSFAULTACT_MASK
#define SCB_SHCRS_BUSFAULTACT 0x2
#define System_Handler_Control_and_State_BUSFAULTACT SCB_SHCRS_BUSFAULTACT
#define SCB_SHCRS_BUSFAULTACT_BIT 1
#define System_Handler_Control_and_State_BUSFAULTACT_BIT SCB_SHCRS_BUSFAULTACT_BIT
#define SCB_SHCRS_MEMFAULTACT_MASK 0x1
#define System_Handler_Control_and_State_MEMFAULTACT_MASK SCB_SHCRS_MEMFAULTACT_MASK
#define SCB_SHCRS_MEMFAULTACT 0x1
#define System_Handler_Control_and_State_MEMFAULTACT SCB_SHCRS_MEMFAULTACT
#define SCB_SHCRS_MEMFAULTACT_BIT 0
#define System_Handler_Control_and_State_MEMFAULTACT_BIT SCB_SHCRS_MEMFAULTACT_BIT

#define SCB_MMSR (*(volatile unsigned char *)0xE000ED28)
#define Memory_Manage_Fault_Status SCB_MMSR
#define SCB_MMSR_OFFSET 0x28
#define Memory_Manage_Fault_Status_OFFSET SCB_MMSR_OFFSET
#define SCB_MMSR_MMARVALID_MASK 0x80
#define Memory_Manage_Fault_Status_MMARVALID_MASK SCB_MMSR_MMARVALID_MASK
#define SCB_MMSR_MMARVALID 0x80
#define Memory_Manage_Fault_Status_MMARVALID SCB_MMSR_MMARVALID
#define SCB_MMSR_MMARVALID_BIT 7
#define Memory_Manage_Fault_Status_MMARVALID_BIT SCB_MMSR_MMARVALID_BIT
#define SCB_MMSR_MSTKERR_MASK 0x10
#define Memory_Manage_Fault_Status_MSTKERR_MASK SCB_MMSR_MSTKERR_MASK
#define SCB_MMSR_MSTKERR 0x10
#define Memory_Manage_Fault_Status_MSTKERR SCB_MMSR_MSTKERR
#define SCB_MMSR_MSTKERR_BIT 4
#define Memory_Manage_Fault_Status_MSTKERR_BIT SCB_MMSR_MSTKERR_BIT
#define SCB_MMSR_MUNSTKERR_MASK 0x8
#define Memory_Manage_Fault_Status_MUNSTKERR_MASK SCB_MMSR_MUNSTKERR_MASK
#define SCB_MMSR_MUNSTKERR 0x8
#define Memory_Manage_Fault_Status_MUNSTKERR SCB_MMSR_MUNSTKERR
#define SCB_MMSR_MUNSTKERR_BIT 3
#define Memory_Manage_Fault_Status_MUNSTKERR_BIT SCB_MMSR_MUNSTKERR_BIT
#define SCB_MMSR_DACCVIOL_MASK 0x2
#define Memory_Manage_Fault_Status_DACCVIOL_MASK SCB_MMSR_DACCVIOL_MASK
#define SCB_MMSR_DACCVIOL 0x2
#define Memory_Manage_Fault_Status_DACCVIOL SCB_MMSR_DACCVIOL
#define SCB_MMSR_DACCVIOL_BIT 1
#define Memory_Manage_Fault_Status_DACCVIOL_BIT SCB_MMSR_DACCVIOL_BIT
#define SCB_MMSR_IACCVIOL_MASK 0x1
#define Memory_Manage_Fault_Status_IACCVIOL_MASK SCB_MMSR_IACCVIOL_MASK
#define SCB_MMSR_IACCVIOL 0x1
#define Memory_Manage_Fault_Status_IACCVIOL SCB_MMSR_IACCVIOL
#define SCB_MMSR_IACCVIOL_BIT 0
#define Memory_Manage_Fault_Status_IACCVIOL_BIT SCB_MMSR_IACCVIOL_BIT

#define SCB_BFSR (*(volatile unsigned char *)0xE000ED29)
#define Bus_Fault_Status SCB_BFSR
#define SCB_BFSR_OFFSET 0x29
#define Bus_Fault_Status_OFFSET SCB_BFSR_OFFSET
#define SCB_BFSR_BFARVALID_MASK 0x80
#define Bus_Fault_Status_BFARVALID_MASK SCB_BFSR_BFARVALID_MASK
#define SCB_BFSR_BFARVALID 0x80
#define Bus_Fault_Status_BFARVALID SCB_BFSR_BFARVALID
#define SCB_BFSR_BFARVALID_BIT 7
#define Bus_Fault_Status_BFARVALID_BIT SCB_BFSR_BFARVALID_BIT
#define SCB_BFSR_STKERR_MASK 0x10
#define Bus_Fault_Status_STKERR_MASK SCB_BFSR_STKERR_MASK
#define SCB_BFSR_STKERR 0x10
#define Bus_Fault_Status_STKERR SCB_BFSR_STKERR
#define SCB_BFSR_STKERR_BIT 4
#define Bus_Fault_Status_STKERR_BIT SCB_BFSR_STKERR_BIT
#define SCB_BFSR_UNSTKERR_MASK 0x8
#define Bus_Fault_Status_UNSTKERR_MASK SCB_BFSR_UNSTKERR_MASK
#define SCB_BFSR_UNSTKERR 0x8
#define Bus_Fault_Status_UNSTKERR SCB_BFSR_UNSTKERR
#define SCB_BFSR_UNSTKERR_BIT 3
#define Bus_Fault_Status_UNSTKERR_BIT SCB_BFSR_UNSTKERR_BIT
#define SCB_BFSR_IMPRECISERR_MASK 0x4
#define Bus_Fault_Status_IMPRECISERR_MASK SCB_BFSR_IMPRECISERR_MASK
#define SCB_BFSR_IMPRECISERR 0x4
#define Bus_Fault_Status_IMPRECISERR SCB_BFSR_IMPRECISERR
#define SCB_BFSR_IMPRECISERR_BIT 2
#define Bus_Fault_Status_IMPRECISERR_BIT SCB_BFSR_IMPRECISERR_BIT
#define SCB_BFSR_PRECISERR_MASK 0x2
#define Bus_Fault_Status_PRECISERR_MASK SCB_BFSR_PRECISERR_MASK
#define SCB_BFSR_PRECISERR 0x2
#define Bus_Fault_Status_PRECISERR SCB_BFSR_PRECISERR
#define SCB_BFSR_PRECISERR_BIT 1
#define Bus_Fault_Status_PRECISERR_BIT SCB_BFSR_PRECISERR_BIT
#define SCB_BFSR_IBUSERR_MASK 0x1
#define Bus_Fault_Status_IBUSERR_MASK SCB_BFSR_IBUSERR_MASK
#define SCB_BFSR_IBUSERR 0x1
#define Bus_Fault_Status_IBUSERR SCB_BFSR_IBUSERR
#define SCB_BFSR_IBUSERR_BIT 0
#define Bus_Fault_Status_IBUSERR_BIT SCB_BFSR_IBUSERR_BIT

