FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1758.h
#define SCB_UFSR (*(volatile unsigned short *)0xE000ED2A)
#define Usage_Fault_Status SCB_UFSR
#define SCB_UFSR_OFFSET 0x2A
#define Usage_Fault_Status_OFFSET SCB_UFSR_OFFSET
#define SCB_UFSR_DIVBYZERO_MASK 0x200
#define Usage_Fault_Status_DIVBYZERO_MASK SCB_UFSR_DIVBYZERO_MASK
#define SCB_UFSR_DIVBYZERO 0x200
#define Usage_Fault_Status_DIVBYZERO SCB_UFSR_DIVBYZERO
#define SCB_UFSR_DIVBYZERO_BIT 9
#define Usage_Fault_Status_DIVBYZERO_BIT SCB_UFSR_DIVBYZERO_BIT
#define SCB_UFSR_UNALIGNED_MASK 0x100
#define Usage_Fault_Status_UNALIGNED_MASK SCB_UFSR_UNALIGNED_MASK
#define SCB_UFSR_UNALIGNED 0x100
#define Usage_Fault_Status_UNALIGNED SCB_UFSR_UNALIGNED
#define SCB_UFSR_UNALIGNED_BIT 8
#define Usage_Fault_Status_UNALIGNED_BIT SCB_UFSR_UNALIGNED_BIT
#define SCB_UFSR_NOCP_MASK 0x8
#define Usage_Fault_Status_NOCP_MASK SCB_UFSR_NOCP_MASK
#define SCB_UFSR_NOCP 0x8
#define Usage_Fault_Status_NOCP SCB_UFSR_NOCP
#define SCB_UFSR_NOCP_BIT 3
#define Usage_Fault_Status_NOCP_BIT SCB_UFSR_NOCP_BIT
#define SCB_UFSR_INVPC_MASK 0x4
#define Usage_Fault_Status_INVPC_MASK SCB_UFSR_INVPC_MASK
#define SCB_UFSR_INVPC 0x4
#define Usage_Fault_Status_INVPC SCB_UFSR_INVPC
#define SCB_UFSR_INVPC_BIT 2
#define Usage_Fault_Status_INVPC_BIT SCB_UFSR_INVPC_BIT
#define SCB_UFSR_INVSTATE_MASK 0x2
#define Usage_Fault_Status_INVSTATE_MASK SCB_UFSR_INVSTATE_MASK
#define SCB_UFSR_INVSTATE 0x2
#define Usage_Fault_Status_INVSTATE SCB_UFSR_INVSTATE
#define SCB_UFSR_INVSTATE_BIT 1
#define Usage_Fault_Status_INVSTATE_BIT SCB_UFSR_INVSTATE_BIT
#define SCB_UFSR_UNDEFINSTR_MASK 0x1
#define Usage_Fault_Status_UNDEFINSTR_MASK SCB_UFSR_UNDEFINSTR_MASK
#define SCB_UFSR_UNDEFINSTR 0x1
#define Usage_Fault_Status_UNDEFINSTR SCB_UFSR_UNDEFINSTR
#define SCB_UFSR_UNDEFINSTR_BIT 0
#define Usage_Fault_Status_UNDEFINSTR_BIT SCB_UFSR_UNDEFINSTR_BIT

#define SCB_HFSR (*(volatile unsigned *)0xE000ED2C)
#define Hard_Fault_Status SCB_HFSR
#define SCB_HFSR_OFFSET 0x2C
#define Hard_Fault_Status_OFFSET SCB_HFSR_OFFSET
#define SCB_HFSR_DEBUGEVT_MASK 0x80000000
#define Hard_Fault_Status_DEBUGEVT_MASK SCB_HFSR_DEBUGEVT_MASK
#define SCB_HFSR_DEBUGEVT 0x80000000
#define Hard_Fault_Status_DEBUGEVT SCB_HFSR_DEBUGEVT
#define SCB_HFSR_DEBUGEVT_BIT 31
#define Hard_Fault_Status_DEBUGEVT_BIT SCB_HFSR_DEBUGEVT_BIT
#define SCB_HFSR_FORCED_MASK 0x40000000
#define Hard_Fault_Status_FORCED_MASK SCB_HFSR_FORCED_MASK
#define SCB_HFSR_FORCED 0x40000000
#define Hard_Fault_Status_FORCED SCB_HFSR_FORCED
#define SCB_HFSR_FORCED_BIT 30
#define Hard_Fault_Status_FORCED_BIT SCB_HFSR_FORCED_BIT
#define SCB_HFSR_VECTTBL_MASK 0x2
#define Hard_Fault_Status_VECTTBL_MASK SCB_HFSR_VECTTBL_MASK
#define SCB_HFSR_VECTTBL 0x2
#define Hard_Fault_Status_VECTTBL SCB_HFSR_VECTTBL
#define SCB_HFSR_VECTTBL_BIT 1
#define Hard_Fault_Status_VECTTBL_BIT SCB_HFSR_VECTTBL_BIT

#define SCB_DFSR (*(volatile unsigned *)0xE000ED30)
#define Debug_Fault_Status SCB_DFSR
#define SCB_DFSR_OFFSET 0x30
#define Debug_Fault_Status_OFFSET SCB_DFSR_OFFSET
#define SCB_DFSR_EXTERNAL_MASK 0x8
#define Debug_Fault_Status_EXTERNAL_MASK SCB_DFSR_EXTERNAL_MASK
#define SCB_DFSR_EXTERNAL 0x8
#define Debug_Fault_Status_EXTERNAL SCB_DFSR_EXTERNAL
#define SCB_DFSR_EXTERNAL_BIT 3
#define Debug_Fault_Status_EXTERNAL_BIT SCB_DFSR_EXTERNAL_BIT
#define SCB_DFSR_VCATCH_MASK 0x8
#define Debug_Fault_Status_VCATCH_MASK SCB_DFSR_VCATCH_MASK
#define SCB_DFSR_VCATCH 0x8
#define Debug_Fault_Status_VCATCH SCB_DFSR_VCATCH
#define SCB_DFSR_VCATCH_BIT 3
#define Debug_Fault_Status_VCATCH_BIT SCB_DFSR_VCATCH_BIT
#define SCB_DFSR_DWTTRAP_MASK 0x4
#define Debug_Fault_Status_DWTTRAP_MASK SCB_DFSR_DWTTRAP_MASK
#define SCB_DFSR_DWTTRAP 0x4
#define Debug_Fault_Status_DWTTRAP SCB_DFSR_DWTTRAP
#define SCB_DFSR_DWTTRAP_BIT 2
#define Debug_Fault_Status_DWTTRAP_BIT SCB_DFSR_DWTTRAP_BIT
#define SCB_DFSR_BKPT_MASK 0x2
#define Debug_Fault_Status_BKPT_MASK SCB_DFSR_BKPT_MASK
#define SCB_DFSR_BKPT 0x2
#define Debug_Fault_Status_BKPT SCB_DFSR_BKPT
#define SCB_DFSR_BKPT_BIT 1
#define Debug_Fault_Status_BKPT_BIT SCB_DFSR_BKPT_BIT
#define SCB_DFSR_HALTED_MASK 0x1
#define Debug_Fault_Status_HALTED_MASK SCB_DFSR_HALTED_MASK
#define SCB_DFSR_HALTED 0x1
#define Debug_Fault_Status_HALTED SCB_DFSR_HALTED
#define SCB_DFSR_HALTED_BIT 0
#define Debug_Fault_Status_HALTED_BIT SCB_DFSR_HALTED_BIT

#define SCB_MMFAR (*(volatile unsigned *)0xE000ED34)
#define Memory_Manage_Fault_Address SCB_MMFAR
#define SCB_MMFAR_OFFSET 0x34
#define Memory_Manage_Fault_Address_OFFSET SCB_MMFAR_OFFSET

#define SCB_BFAR (*(volatile unsigned *)0xE000ED38)
#define Bus_Fault_Address SCB_BFAR
#define SCB_BFAR_OFFSET 0x38
#define Bus_Fault_Address_OFFSET SCB_BFAR_OFFSET

#define SCB_AFSR (*(volatile unsigned *)0xE000ED3C)
#define Auxillary_Fault_Address SCB_AFSR
#define SCB_AFSR_OFFSET 0x3C
#define Auxillary_Fault_Address_OFFSET SCB_AFSR_OFFSET

#define SCB_PFR0 (*(volatile unsigned *)0xE000ED40)
#define PFR0 SCB_PFR0
#define SCB_PFR0_OFFSET 0x40
#define PFR0_OFFSET SCB_PFR0_OFFSET

#define SCB_PFR1 (*(volatile unsigned *)0xE000ED44)
#define PFR1 SCB_PFR1
#define SCB_PFR1_OFFSET 0x44
#define PFR1_OFFSET SCB_PFR1_OFFSET

#define SCB_DFR0 (*(volatile unsigned *)0xE000ED48)
#define DFR0 SCB_DFR0
#define SCB_DFR0_OFFSET 0x48
#define DFR0_OFFSET SCB_DFR0_OFFSET

#define SCB_AFR0 (*(volatile unsigned *)0xE000ED4C)
#define AFR0 SCB_AFR0
#define SCB_AFR0_OFFSET 0x4C
#define AFR0_OFFSET SCB_AFR0_OFFSET

#define SCB_MMFR0 (*(volatile unsigned *)0xE000ED50)
#define MMFR0 SCB_MMFR0
#define SCB_MMFR0_OFFSET 0x50
#define MMFR0_OFFSET SCB_MMFR0_OFFSET

#define SCB_MMFR1 (*(volatile unsigned *)0xE000ED54)
#define MMFR1 SCB_MMFR1
#define SCB_MMFR1_OFFSET 0x54
#define MMFR1_OFFSET SCB_MMFR1_OFFSET

#define SCB_MMFR2 (*(volatile unsigned *)0xE000ED58)
#define MMFR2 SCB_MMFR2
#define SCB_MMFR2_OFFSET 0x58
#define MMFR2_OFFSET SCB_MMFR2_OFFSET

#define SCB_MMFR3 (*(volatile unsigned *)0xE000ED5C)
#define MMFR3 SCB_MMFR3
#define SCB_MMFR3_OFFSET 0x5C
#define MMFR3_OFFSET SCB_MMFR3_OFFSET

#define SCB_ISAR0 (*(volatile unsigned *)0xE000ED60)
#define ISAR0 SCB_ISAR0
#define SCB_ISAR0_OFFSET 0x60
#define ISAR0_OFFSET SCB_ISAR0_OFFSET

